Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg_fs.h
/*
; stm32V873_otg_fs.
; =================

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32V873_otg_fs equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// OTG_FS address definitions
// --------------------------

typedef struct {
    volatile    uint32_t    OTG_GOTGCTL;
    volatile    uint32_t    OTG_GOTGINT;
    volatile    uint32_t    OTG_GAHBCFG;
    volatile    uint32_t    OTG_GUSBCFG;
    volatile    uint32_t    OTG_GRSTCTL;
    volatile    uint32_t    OTG_GINTSTS;
    volatile    uint32_t    OTG_GINTMSK;
    volatile    uint32_t    OTG_GRXSTSR;
    volatile    uint32_t    OTG_GRXSTSP;
    volatile    uint32_t    OTG_GRXFSIZ;
        union {
    volatile    uint32_t    OTG_HNPTXFSIZ;
    volatile    uint32_t    OTG_DIEPTXF0;
        };
    volatile    uint32_t    OTG_HNPTXSTS;
    volatile    uint32_t    RESERVED0[2];
    volatile    uint32_t    OTG_GCCFG;
    volatile    uint32_t    OTG_CID;
    volatile    uint32_t    RESERVED1[5];
    volatile    uint32_t    OTG_GLPMCFG;
    volatile    uint32_t    RESERVED2[42];
    volatile    uint32_t    OTG_HPTXFSIZ;
    volatile    uint32_t    OTG_DIEPTXF1;
    volatile    uint32_t    OTG_DIEPTXF2;
    volatile    uint32_t    OTG_DIEPTXF3;
    volatile    uint32_t    OTG_DIEPTXF4;
    volatile    uint32_t    OTG_DIEPTXF5;
    volatile    uint32_t    RESERVED3[186];
    volatile    uint32_t    OTG_HCFG;
    volatile    uint32_t    OTG_HFIR;
    volatile    uint32_t    OTG_HFNUM;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    OTG_HPTXSTS;
    volatile    uint32_t    OTG_HAINT;
    volatile    uint32_t    OTG_HAINTMSK;
    volatile    uint32_t    RESERVED5[9];
    volatile    uint32_t    OTG_HPRT;
    volatile    uint32_t    RESERVED6[47];
    volatile    uint32_t    OTG_HCCHAR0;
    volatile    uint32_t    RESERVED7;
    volatile    uint32_t    OTG_HCINT0;
    volatile    uint32_t    OTG_HCINTMSK0;
    volatile    uint32_t    OTG_HCTSIZ0;
    volatile    uint32_t    RESERVED8[3];
    volatile    uint32_t    OTG_HCCHAR1;
    volatile    uint32_t    RESERVED9;
    volatile    uint32_t    OTG_HCINT1;
    volatile    uint32_t    OTG_HCINTMSK1;
    volatile    uint32_t    OTG_HCTSIZ1;
    volatile    uint32_t    RESERVED10[3];
    volatile    uint32_t    OTG_HCCHAR2;
    volatile    uint32_t    RESERVED11;
    volatile    uint32_t    OTG_HCINT2;
    volatile    uint32_t    OTG_HCINTMSK2;
    volatile    uint32_t    OTG_HCTSIZ2;
    volatile    uint32_t    RESERVED12[3];
    volatile    uint32_t    OTG_HCCHAR3;
    volatile    uint32_t    RESERVED13;
    volatile    uint32_t    OTG_HCINT3;
    volatile    uint32_t    OTG_HCINTMSK3;
    volatile    uint32_t    OTG_HCTSIZ3;
    volatile    uint32_t    RESERVED14[3];
    volatile    uint32_t    OTG_HCCHAR4;
    volatile    uint32_t    RESERVED15;
    volatile    uint32_t    OTG_HCINT4;
    volatile    uint32_t    OTG_HCINTMSK4;
    volatile    uint32_t    OTG_HCTSIZ4;
    volatile    uint32_t    RESERVED16[3];
    volatile    uint32_t    OTG_HCCHAR5;
    volatile    uint32_t    RESERVED17;
    volatile    uint32_t    OTG_HCINT5;
    volatile    uint32_t    OTG_HCINTMSK5;
    volatile    uint32_t    OTG_HCTSIZ5;
    volatile    uint32_t    RESERVED18[3];
    volatile    uint32_t    OTG_HCCHAR6;
    volatile    uint32_t    RESERVED19;
    volatile    uint32_t    OTG_HCINT6;
    volatile    uint32_t    OTG_HCINTMSK6;
    volatile    uint32_t    OTG_HCTSIZ6;
    volatile    uint32_t    RESERVED20[3];
    volatile    uint32_t    OTG_HCCHAR7;
    volatile    uint32_t    RESERVED21;
    volatile    uint32_t    OTG_HCINT7;
    volatile    uint32_t    OTG_HCINTMSK7;
    volatile    uint32_t    OTG_HCTSIZ7;
    volatile    uint32_t    RESERVED22[3];
    volatile    uint32_t    OTG_HCCHAR8;
    volatile    uint32_t    RESERVED23;
    volatile    uint32_t    OTG_HCINT8;
    volatile    uint32_t    OTG_HCINTMSK8;
    volatile    uint32_t    OTG_HCTSIZ8;
    volatile    uint32_t    RESERVED24[3];
    volatile    uint32_t    OTG_HCCHAR9;
    volatile    uint32_t    RESERVED25;
    volatile    uint32_t    OTG_HCINT9;
    volatile    uint32_t    OTG_HCINTMSK9;
    volatile    uint32_t    OTG_HCTSIZ9;
    volatile    uint32_t    RESERVED26[3];
    volatile    uint32_t    OTG_HCCHAR10;
    volatile    uint32_t    RESERVED27;
    volatile    uint32_t    OTG_HCINT10;
    volatile    uint32_t    OTG_HCINTMSK10;
    volatile    uint32_t    OTG_HCTSIZ10;
    volatile    uint32_t    RESERVED28[3];
    volatile    uint32_t    OTG_HCCHAR11;
    volatile    uint32_t    RESERVED29;
    volatile    uint32_t    OTG_HCINT11;
    volatile    uint32_t    OTG_HCINTMSK11;
    volatile    uint32_t    OTG_HCTSIZ11;
    volatile    uint32_t    RESERVED30[99];
    volatile    uint32_t    OTG_DCFG;
    volatile    uint32_t    OTG_DCTL;
    volatile    uint32_t    OTG_DSTS;
    volatile    uint32_t    RESERVED31;
    volatile    uint32_t    OTG_DIEPMSK;
    volatile    uint32_t    OTG_DOEPMSK;
    volatile    uint32_t    OTG_DAINT;
    volatile    uint32_t    OTG_DAINTMSK;
    volatile    uint32_t    RESERVED32[5];
    volatile    uint32_t    OTG_DIEPEMPMSK;
    volatile    uint32_t    OTG_DEACHINT;
    volatile    uint32_t    OTG_DEACHINTMSK;
    volatile    uint32_t    RESERVED33;
    volatile    uint32_t    OTG_HS_DIEPEACHMSK1;
    volatile    uint32_t    RESERVED34[15];
    volatile    uint32_t    OTG_HS_DOEPEACHMSK1;
    volatile    uint32_t    RESERVED35[30];
    volatile    uint32_t    OTG_DIEPCTL0;
    volatile    uint32_t    RESERVED36;
    volatile    uint32_t    OTG_DIEPINT0;
    volatile    uint32_t    RESERVED37;
    volatile    uint32_t    OTG_DIEPTSIZ0;
    volatile    uint32_t    RESERVED38;
    volatile    uint32_t    OTG_DTXFSTS0;
    volatile    uint32_t    RESERVED39;
        union {
    volatile    uint32_t    OTG_DIEPCTL1;
    volatile    uint32_t    OTG_DIEPCTL1_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED40;
    volatile    uint32_t    OTG_DIEPINT1;
    volatile    uint32_t    RESERVED41;
    volatile    uint32_t    OTG_DIEPTSIZ1;
    volatile    uint32_t    RESERVED42;
    volatile    uint32_t    OTG_DTXFSTS1;
    volatile    uint32_t    RESERVED43;
        union {
    volatile    uint32_t    OTG_DIEPCTL2;
    volatile    uint32_t    OTG_DIEPCTL2_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED44;
    volatile    uint32_t    OTG_DIEPINT2;
    volatile    uint32_t    RESERVED45;
    volatile    uint32_t    OTG_DIEPTSIZ2;
    volatile    uint32_t    RESERVED46;
    volatile    uint32_t    OTG_DTXFSTS2;
    volatile    uint32_t    RESERVED47;
        union {
    volatile    uint32_t    OTG_DIEPCTL3;
    volatile    uint32_t    OTG_DIEPCTL3_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED48;
    volatile    uint32_t    OTG_DIEPINT3;
    volatile    uint32_t    RESERVED49;
    volatile    uint32_t    OTG_DIEPTSIZ3;
    volatile    uint32_t    RESERVED50;
    volatile    uint32_t    OTG_DTXFSTS3;
    volatile    uint32_t    RESERVED51;
        union {
    volatile    uint32_t    OTG_DIEPCTL4;
    volatile    uint32_t    OTG_DIEPCTL4_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED52;
    volatile    uint32_t    OTG_DIEPINT4;
    volatile    uint32_t    RESERVED53;
    volatile    uint32_t    OTG_DIEPTSIZ4;
    volatile    uint32_t    RESERVED54;
    volatile    uint32_t    OTG_DTXFSTS4;
    volatile    uint32_t    RESERVED55;
        union {
    volatile    uint32_t    OTG_DIEPCTL5;
    volatile    uint32_t    OTG_DIEPCTL5_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED56;
    volatile    uint32_t    OTG_DIEPINT5;
    volatile    uint32_t    RESERVED57;
    volatile    uint32_t    OTG_DIEPTSIZ5;
    volatile    uint32_t    RESERVED58;
    volatile    uint32_t    OTG_DTXFSTS5;
    volatile    uint32_t    RESERVED59[81];
    volatile    uint32_t    OTG_DOEPCTL0;
    volatile    uint32_t    RESERVED60;
    volatile    uint32_t    OTG_DOEPINT0;
    volatile    uint32_t    RESERVED61;
    volatile    uint32_t    OTG_DOEPTSIZ0;
    volatile    uint32_t    RESERVED62[3];
        union {
    volatile    uint32_t    OTG_DOEPCTL1;
    volatile    uint32_t    OTG_DOEPCTL1_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED63;
    volatile    uint32_t    OTG_DOEPINT1;
    volatile    uint32_t    RESERVED64;
    volatile    uint32_t    OTG_DOEPTSIZ1;
    volatile    uint32_t    RESERVED65[3];
        union {
    volatile    uint32_t    OTG_DOEPCTL2;
    volatile    uint32_t    OTG_DOEPCTL2_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED66;
    volatile    uint32_t    OTG_DOEPINT2;
    volatile    uint32_t    RESERVED67;
    volatile    uint32_t    OTG_DOEPTSIZ2;
    volatile    uint32_t    RESERVED68[3];
        union {
    volatile    uint32_t    OTG_DOEPCTL3;
    volatile    uint32_t    OTG_DOEPCTL3_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED69;
    volatile    uint32_t    OTG_DOEPINT3;
    volatile    uint32_t    RESERVED70;
    volatile    uint32_t    OTG_DOEPTSIZ3;
    volatile    uint32_t    RESERVED71[3];
        union {
    volatile    uint32_t    OTG_DOEPCTL4;
    volatile    uint32_t    OTG_DOEPCTL4_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED72;
    volatile    uint32_t    OTG_DOEPINT4;
    volatile    uint32_t    RESERVED73;
    volatile    uint32_t    OTG_DOEPTSIZ4;
    volatile    uint32_t    RESERVED74[3];
        union {
    volatile    uint32_t    OTG_DOEPCTL5;
    volatile    uint32_t    OTG_DOEPCTL5_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED75;
    volatile    uint32_t    OTG_DOEPINT5;
    volatile    uint32_t    RESERVED76;
    volatile    uint32_t    OTG_DOEPTSIZ5;
    volatile    uint32_t    RESERVED77[147];
    volatile    uint32_t    OTG_PCGCCTL;
    volatile    uint32_t    OTG_PCGCCTL1;
} OTG_FS_TypeDef;

#if (defined(__cplusplus))
#define OTG_FS_NS   reinterpret_cast<OTG_FS_TypeDef *>(0x40080000u)
#define OTG_FS_S    reinterpret_cast<OTG_FS_TypeDef *>(0x50080000u)

#else
#define OTG_FS_NS   ((OTG_FS_TypeDef *)0x40080000u)
#define OTG_FS_S    ((OTG_FS_TypeDef *)0x50080000u)
#endif

