Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg_fs.h
// OTG_GINTMSK Configuration

#define OTG_FS_OTG_GINTMSK_WUIM                                         (0x1u<<31)
#define OTG_FS_OTG_GINTMSK_SRQIM                                        (0x1u<<30)
#define OTG_FS_OTG_GINTMSK_DISCINT                                      (0x1u<<29)
#define OTG_FS_OTG_GINTMSK_CIDSCHGM                                     (0x1u<<28)
#define OTG_FS_OTG_GINTMSK_LPMINTM                                      (0x1u<<27)
#define OTG_FS_OTG_GINTMSK_PTXFEM                                       (0x1u<<26)
#define OTG_FS_OTG_GINTMSK_HCIM                                         (0x1u<<25)
#define OTG_FS_OTG_GINTMSK_PRTIM                                        (0x1u<<24)
#define OTG_FS_OTG_GINTMSK_IPXFRM                                       (0x1u<<21)
#define OTG_FS_OTG_GINTMSK_NPTXFEM                                      (0x1u<<5)
#define OTG_FS_OTG_GINTMSK_RXFLVLM                                      (0x1u<<4)
#define OTG_FS_OTG_GINTMSK_SOFM                                         (0x1u<<3)
#define OTG_FS_OTG_GINTMSK_OTGINT                                       (0x1u<<2)
#define OTG_FS_OTG_GINTMSK_MMISM                                        (0x1u<<1)

#define OTG_FS_OTG_GINTMSK_WUIM_B_0X0                                   (0x0u<<31)
#define OTG_FS_OTG_GINTMSK_WUIM_B_0X1                                   (0x1u<<31)
#define OTG_FS_OTG_GINTMSK_SRQIM_B_0X0                                  (0x0u<<30)
#define OTG_FS_OTG_GINTMSK_SRQIM_B_0X1                                  (0x1u<<30)
#define OTG_FS_OTG_GINTMSK_DISCINT_B_0X0                                (0x0u<<29)
#define OTG_FS_OTG_GINTMSK_DISCINT_B_0X1                                (0x1u<<29)
#define OTG_FS_OTG_GINTMSK_CIDSCHGM_B_0X0                               (0x0u<<28)
#define OTG_FS_OTG_GINTMSK_CIDSCHGM_B_0X1                               (0x1u<<28)
#define OTG_FS_OTG_GINTMSK_LPMINTM_B_0X0                                (0x0u<<27)
#define OTG_FS_OTG_GINTMSK_LPMINTM_B_0X1                                (0x1u<<27)
#define OTG_FS_OTG_GINTMSK_PTXFEM_B_0X0                                 (0x0u<<26)
#define OTG_FS_OTG_GINTMSK_PTXFEM_B_0X1                                 (0x1u<<26)
#define OTG_FS_OTG_GINTMSK_HCIM_B_0X0                                   (0x0u<<25)
#define OTG_FS_OTG_GINTMSK_HCIM_B_0X1                                   (0x1u<<25)
#define OTG_FS_OTG_GINTMSK_PRTIM_B_0X0                                  (0x0u<<24)
#define OTG_FS_OTG_GINTMSK_PRTIM_B_0X1                                  (0x1u<<24)
#define OTG_FS_OTG_GINTMSK_IPXFRM_B_0X0                                 (0x0u<<21)
#define OTG_FS_OTG_GINTMSK_IPXFRM_B_0X1                                 (0x1u<<21)
#define OTG_FS_OTG_GINTMSK_NPTXFEM_B_0X0                                (0x0u<<5)
#define OTG_FS_OTG_GINTMSK_NPTXFEM_B_0X1                                (0x1u<<5)
#define OTG_FS_OTG_GINTMSK_RXFLVLM_B_0X0                                (0x0u<<4)
#define OTG_FS_OTG_GINTMSK_RXFLVLM_B_0X1                                (0x1u<<4)
#define OTG_FS_OTG_GINTMSK_SOFM_B_0X0                                   (0x0u<<3)
#define OTG_FS_OTG_GINTMSK_SOFM_B_0X1                                   (0x1u<<3)
#define OTG_FS_OTG_GINTMSK_OTGINT_B_0X0                                 (0x0u<<2)
#define OTG_FS_OTG_GINTMSK_OTGINT_B_0X1                                 (0x1u<<2)
#define OTG_FS_OTG_GINTMSK_MMISM_B_0X0                                  (0x0u<<1)
#define OTG_FS_OTG_GINTMSK_MMISM_B_0X1                                  (0x1u<<1)

// OTG_GRXSTSR Configuration

#define OTG_FS_OTG_GRXSTSR_PKTSTS                                       (0xFu<<17)
#define OTG_FS_OTG_GRXSTSR_PKTSTS_0                                     (0x1u<<17)
#define OTG_FS_OTG_GRXSTSR_DPID                                         (0x3u<<15)
#define OTG_FS_OTG_GRXSTSR_DPID_0                                       (0x1u<<15)
#define OTG_FS_OTG_GRXSTSR_BCNT                                         (0x7FFu<<4)
#define OTG_FS_OTG_GRXSTSR_BCNT_0                                       (0x1u<<4)
#define OTG_FS_OTG_GRXSTSR_CHNUM                                        (0xFu<<0)
#define OTG_FS_OTG_GRXSTSR_CHNUM_0                                      (0x1u<<0)

#define OTG_FS_OTG_GRXSTSR_PKTSTS_B_0X2                                 (0x2u<<17)
#define OTG_FS_OTG_GRXSTSR_PKTSTS_B_0X3                                 (0x3u<<17)
#define OTG_FS_OTG_GRXSTSR_PKTSTS_B_0X5                                 (0x5u<<17)
#define OTG_FS_OTG_GRXSTSR_PKTSTS_B_0X7                                 (0x7u<<17)
#define OTG_FS_OTG_GRXSTSR_DPID_B_0X0                                   (0x0u<<15)
#define OTG_FS_OTG_GRXSTSR_DPID_B_0X2                                   (0x2u<<15)

// OTG_GRXSTSP Configuration

#define OTG_FS_OTG_GRXSTSP_PKTSTS                                       (0xFu<<17)
#define OTG_FS_OTG_GRXSTSP_PKTSTS_0                                     (0x1u<<17)
#define OTG_FS_OTG_GRXSTSP_DPID                                         (0x3u<<15)
#define OTG_FS_OTG_GRXSTSP_DPID_0                                       (0x1u<<15)
#define OTG_FS_OTG_GRXSTSP_BCNT                                         (0x7FFu<<4)
#define OTG_FS_OTG_GRXSTSP_BCNT_0                                       (0x1u<<4)
#define OTG_FS_OTG_GRXSTSP_CHNUM                                        (0xFu<<0)
#define OTG_FS_OTG_GRXSTSP_CHNUM_0                                      (0x1u<<0)

#define OTG_FS_OTG_GRXSTSP_PKTSTS_B_0X2                                 (0x2u<<17)
#define OTG_FS_OTG_GRXSTSP_PKTSTS_B_0X3                                 (0x3u<<17)
#define OTG_FS_OTG_GRXSTSP_PKTSTS_B_0X5                                 (0x5u<<17)
#define OTG_FS_OTG_GRXSTSP_PKTSTS_B_0X7                                 (0x7u<<17)
#define OTG_FS_OTG_GRXSTSP_DPID_B_0X0                                   (0x0u<<15)
#define OTG_FS_OTG_GRXSTSP_DPID_B_0X2                                   (0x2u<<15)

// OTG_GRXFSIZ Configuration

#define OTG_FS_OTG_GRXFSIZ_RXFD                                         (0xFFFFu<<0)
#define OTG_FS_OTG_GRXFSIZ_RXFD_0                                       (0x1u<<0)

// OTG_HNPTXFSIZ Configuration

#define OTG_FS_OTG_HNPTXFSIZ_NPTXFD                                     (0xFFFFu<<16)
#define OTG_FS_OTG_HNPTXFSIZ_NPTXFD_0                                   (0x1u<<16)
#define OTG_FS_OTG_HNPTXFSIZ_NPTXFSA                                    (0xFFFFu<<0)
#define OTG_FS_OTG_HNPTXFSIZ_NPTXFSA_0                                  (0x1u<<0)

// OTG_DIEPTXF0 Configuration

