Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg_fs.h
#define OTG_FS_OTG_DIEPTXF0_TX0FD                                       (0xFFFFu<<16)
#define OTG_FS_OTG_DIEPTXF0_TX0FD_0                                     (0x1u<<16)
#define OTG_FS_OTG_DIEPTXF0_TX0FSA                                      (0xFFFFu<<0)
#define OTG_FS_OTG_DIEPTXF0_TX0FSA_0                                    (0x1u<<0)

// OTG_HNPTXSTS Configuration

#define OTG_FS_OTG_HNPTXSTS_NPTXQTOP                                    (0x7Fu<<24)
#define OTG_FS_OTG_HNPTXSTS_NPTXQTOP_0                                  (0x1u<<24)
#define OTG_FS_OTG_HNPTXSTS_NPTQXSAV                                    (0xFFu<<16)
#define OTG_FS_OTG_HNPTXSTS_NPTQXSAV_0                                  (0x1u<<16)
#define OTG_FS_OTG_HNPTXSTS_NPTXFSAV                                    (0xFFFFu<<0)
#define OTG_FS_OTG_HNPTXSTS_NPTXFSAV_0                                  (0x1u<<0)

#define OTG_FS_OTG_HNPTXSTS_NPTQXSAV_B_0X0                              (0x0u<<16)
#define OTG_FS_OTG_HNPTXSTS_NPTQXSAV_B_0X1                              (0x1u<<16)
#define OTG_FS_OTG_HNPTXSTS_NPTXFSAV_B_0X0                              (0x0u<<0)
#define OTG_FS_OTG_HNPTXSTS_NPTXFSAV_B_0X1                              (0x1u<<0)

// OTG_GCCFG Configuration

#define OTG_FS_OTG_GCCFG_FORCEHOSTPD                                    (0x1u<<25)
#define OTG_FS_OTG_GCCFG_COMPDIS                                        (0x1u<<24)
#define OTG_FS_OTG_GCCFG_VBDEN                                          (0x1u<<21)
#define OTG_FS_OTG_GCCFG_SDEN                                           (0x1u<<20)
#define OTG_FS_OTG_GCCFG_PDEN                                           (0x1u<<19)
#define OTG_FS_OTG_GCCFG_BCDEN                                          (0x1u<<17)
#define OTG_FS_OTG_GCCFG_PWRDWN                                         (0x1u<<16)
#define OTG_FS_OTG_GCCFG_SESSVLD                                        (0x1u<<4)
#define OTG_FS_OTG_GCCFG_PS2DET                                         (0x1u<<3)
#define OTG_FS_OTG_GCCFG_SDET                                           (0x1u<<2)
#define OTG_FS_OTG_GCCFG_PDET                                           (0x1u<<1)

#define OTG_FS_OTG_GCCFG_FORCEHOSTPD_B_0X0                              (0x0u<<25)
#define OTG_FS_OTG_GCCFG_FORCEHOSTPD_B_0X1                              (0x1u<<25)
#define OTG_FS_OTG_GCCFG_COMPDIS_B_0X0                                  (0x0u<<24)
#define OTG_FS_OTG_GCCFG_COMPDIS_B_0X1                                  (0x1u<<24)
#define OTG_FS_OTG_GCCFG_SESSVLD_B_0X0                                  (0x0u<<4)
#define OTG_FS_OTG_GCCFG_SESSVLD_B_0X1                                  (0x1u<<4)
#define OTG_FS_OTG_GCCFG_PS2DET_B_0X0                                   (0x0u<<3)
#define OTG_FS_OTG_GCCFG_PS2DET_B_0X1                                   (0x1u<<3)
#define OTG_FS_OTG_GCCFG_SDET_B_0X0                                     (0x0u<<2)
#define OTG_FS_OTG_GCCFG_SDET_B_0X1                                     (0x1u<<2)
#define OTG_FS_OTG_GCCFG_PDET_B_0X0                                     (0x0u<<1)
#define OTG_FS_OTG_GCCFG_PDET_B_0X1                                     (0x1u<<1)

// OTG_CID Configuration

#define OTG_FS_OTG_CID_PRODUCT_ID                                       (0xFFFFFFFFu<<0)
#define OTG_FS_OTG_CID_PRODUCT_ID_0                                     (0x1u<<0)

// OTG_GLPMCFG Configuration

#define OTG_FS_OTG_GLPMCFG_ENBESL                                       (0x1u<<28)
#define OTG_FS_OTG_GLPMCFG_LPMRCNTSTS                                   (0x7u<<25)
#define OTG_FS_OTG_GLPMCFG_LPMRCNTSTS_0                                 (0x1u<<25)
#define OTG_FS_OTG_GLPMCFG_SNDLPM                                       (0x1u<<24)
#define OTG_FS_OTG_GLPMCFG_LPMRCNT                                      (0x7u<<21)
#define OTG_FS_OTG_GLPMCFG_LPMRCNT_0                                    (0x1u<<21)
#define OTG_FS_OTG_GLPMCFG_LPMCHIDX                                     (0xFu<<17)
#define OTG_FS_OTG_GLPMCFG_LPMCHIDX_0                                   (0x1u<<17)
#define OTG_FS_OTG_GLPMCFG_L1RSMOK                                      (0x1u<<16)
#define OTG_FS_OTG_GLPMCFG_SLPSTS                                       (0x1u<<15)
#define OTG_FS_OTG_GLPMCFG_LPMRSP                                       (0x3u<<13)
#define OTG_FS_OTG_GLPMCFG_LPMRSP_0                                     (0x1u<<13)
#define OTG_FS_OTG_GLPMCFG_L1DSEN                                       (0x1u<<12)
#define OTG_FS_OTG_GLPMCFG_BESLTHRS                                     (0xFu<<8)
#define OTG_FS_OTG_GLPMCFG_BESLTHRS_0                                   (0x1u<<8)
#define OTG_FS_OTG_GLPMCFG_L1SSEN                                       (0x1u<<7)
#define OTG_FS_OTG_GLPMCFG_REMWAKE                                      (0x1u<<6)
#define OTG_FS_OTG_GLPMCFG_BESL                                         (0xFu<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_0                                       (0x1u<<2)
#define OTG_FS_OTG_GLPMCFG_LPMACK                                       (0x1u<<1)
#define OTG_FS_OTG_GLPMCFG_LPMEN                                        (0x1u<<0)

#define OTG_FS_OTG_GLPMCFG_ENBESL_B_0X0                                 (0x0u<<28)
#define OTG_FS_OTG_GLPMCFG_ENBESL_B_0X1                                 (0x1u<<28)
#define OTG_FS_OTG_GLPMCFG_L1RSMOK_B_0X1                                (0x1u<<16)
#define OTG_FS_OTG_GLPMCFG_L1RSMOK_B_0X0                                (0x0u<<16)
#define OTG_FS_OTG_GLPMCFG_SLPSTS_B_0X0                                 (0x0u<<15)
#define OTG_FS_OTG_GLPMCFG_SLPSTS_B_0X1                                 (0x1u<<15)
#define OTG_FS_OTG_GLPMCFG_LPMRSP_B_0X3                                 (0x3u<<13)
#define OTG_FS_OTG_GLPMCFG_LPMRSP_B_0X2                                 (0x2u<<13)
#define OTG_FS_OTG_GLPMCFG_LPMRSP_B_0X1                                 (0x1u<<13)
#define OTG_FS_OTG_GLPMCFG_LPMRSP_B_0X0                                 (0x0u<<13)
#define OTG_FS_OTG_GLPMCFG_BESLTHRS_B_0X0                               (0x0u<<8)
#define OTG_FS_OTG_GLPMCFG_BESLTHRS_B_0X1                               (0x1u<<8)
#define OTG_FS_OTG_GLPMCFG_BESLTHRS_B_0X2                               (0x2u<<8)
#define OTG_FS_OTG_GLPMCFG_BESLTHRS_B_0X3                               (0x3u<<8)
#define OTG_FS_OTG_GLPMCFG_BESLTHRS_B_0X4                               (0x4u<<8)
#define OTG_FS_OTG_GLPMCFG_BESLTHRS_B_0X5                               (0x5u<<8)
#define OTG_FS_OTG_GLPMCFG_BESLTHRS_B_0X6                               (0x6u<<8)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0X0                                   (0x0u<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0X1                                   (0x1u<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0X2                                   (0x2u<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0X3                                   (0x3u<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0X4                                   (0x4u<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0X5                                   (0x5u<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0X6                                   (0x6u<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0X7                                   (0x7u<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0X8                                   (0x8u<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0X9                                   (0x9u<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0XA                                   (0xAu<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0XB                                   (0xBu<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0XC                                   (0xCu<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0XD                                   (0xDu<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0XE                                   (0xEu<<2)
#define OTG_FS_OTG_GLPMCFG_BESL_B_0XF                                   (0xFu<<2)
#define OTG_FS_OTG_GLPMCFG_LPMACK_B_0X1                                 (0x1u<<1)
#define OTG_FS_OTG_GLPMCFG_LPMACK_B_0X0                                 (0x0u<<1)
#define OTG_FS_OTG_GLPMCFG_LPMEN_B_0X0                                  (0x0u<<0)
#define OTG_FS_OTG_GLPMCFG_LPMEN_B_0X1                                  (0x1u<<0)

// OTG_HPTXFSIZ Configuration

#define OTG_FS_OTG_HPTXFSIZ_PTXFSIZ                                     (0xFFFFu<<16)
#define OTG_FS_OTG_HPTXFSIZ_PTXFSIZ_0                                   (0x1u<<16)
#define OTG_FS_OTG_HPTXFSIZ_PTXSA                                       (0xFFFFu<<0)
#define OTG_FS_OTG_HPTXFSIZ_PTXSA_0                                     (0x1u<<0)

// OTG_DIEPTXF1 Configuration

