Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg_fs.h
#define OTG_FS_OTG_HCINT0_DTERR                                         (0x1u<<10)
#define OTG_FS_OTG_HCINT0_FRMOR                                         (0x1u<<9)
#define OTG_FS_OTG_HCINT0_BBERR                                         (0x1u<<8)
#define OTG_FS_OTG_HCINT0_TXERR                                         (0x1u<<7)
#define OTG_FS_OTG_HCINT0_ACK                                           (0x1u<<5)
#define OTG_FS_OTG_HCINT0_NAK                                           (0x1u<<4)
#define OTG_FS_OTG_HCINT0_STALL                                         (0x1u<<3)
#define OTG_FS_OTG_HCINT0_CHH                                           (0x1u<<1)
#define OTG_FS_OTG_HCINT0_XFRC                                          (0x1u<<0)

// OTG_HCINTMSK0 Configuration

#define OTG_FS_OTG_HCINTMSK0_DTERRM                                     (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK0_FRMORM                                     (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK0_BBERRM                                     (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK0_TXERRM                                     (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK0_ACKM                                       (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK0_NAKM                                       (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK0_STALLM                                     (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK0_CHHM                                       (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK0_XFRCM                                      (0x1u<<0)

#define OTG_FS_OTG_HCINTMSK0_DTERRM_B_0X0                               (0x0u<<10)
#define OTG_FS_OTG_HCINTMSK0_DTERRM_B_0X1                               (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK0_FRMORM_B_0X0                               (0x0u<<9)
#define OTG_FS_OTG_HCINTMSK0_FRMORM_B_0X1                               (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK0_BBERRM_B_0X0                               (0x0u<<8)
#define OTG_FS_OTG_HCINTMSK0_BBERRM_B_0X1                               (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK0_TXERRM_B_0X0                               (0x0u<<7)
#define OTG_FS_OTG_HCINTMSK0_TXERRM_B_0X1                               (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK0_ACKM_B_0X0                                 (0x0u<<5)
#define OTG_FS_OTG_HCINTMSK0_ACKM_B_0X1                                 (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK0_NAKM_B_0X0                                 (0x0u<<4)
#define OTG_FS_OTG_HCINTMSK0_NAKM_B_0X1                                 (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK0_STALLM_B_0X0                               (0x0u<<3)
#define OTG_FS_OTG_HCINTMSK0_STALLM_B_0X1                               (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK0_CHHM_B_0X0                                 (0x0u<<1)
#define OTG_FS_OTG_HCINTMSK0_CHHM_B_0X1                                 (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK0_XFRCM_B_0X0                                (0x0u<<0)
#define OTG_FS_OTG_HCINTMSK0_XFRCM_B_0X1                                (0x1u<<0)

// OTG_HCTSIZ0 Configuration

#define OTG_FS_OTG_HCTSIZ0_DOPNG                                        (0x1u<<31)
#define OTG_FS_OTG_HCTSIZ0_DPID                                         (0x3u<<29)
#define OTG_FS_OTG_HCTSIZ0_DPID_0                                       (0x1u<<29)
#define OTG_FS_OTG_HCTSIZ0_PKTCNT                                       (0x3FFu<<19)
#define OTG_FS_OTG_HCTSIZ0_PKTCNT_0                                     (0x1u<<19)
#define OTG_FS_OTG_HCTSIZ0_XFRSIZ                                       (0x7FFFFu<<0)
#define OTG_FS_OTG_HCTSIZ0_XFRSIZ_0                                     (0x1u<<0)

#define OTG_FS_OTG_HCTSIZ0_DPID_B_0X0                                   (0x0u<<29)
#define OTG_FS_OTG_HCTSIZ0_DPID_B_0X2                                   (0x2u<<29)
#define OTG_FS_OTG_HCTSIZ0_DPID_B_0X3                                   (0x3u<<29)

// OTG_HCCHAR1 Configuration

#define OTG_FS_OTG_HCCHAR1_CHENA                                        (0x1u<<31)
#define OTG_FS_OTG_HCCHAR1_CHDIS                                        (0x1u<<30)
#define OTG_FS_OTG_HCCHAR1_ODDFRM                                       (0x1u<<29)
#define OTG_FS_OTG_HCCHAR1_DAD                                          (0x7Fu<<22)
#define OTG_FS_OTG_HCCHAR1_DAD_0                                        (0x1u<<22)
#define OTG_FS_OTG_HCCHAR1_MCNT                                         (0x3u<<20)
#define OTG_FS_OTG_HCCHAR1_MCNT_0                                       (0x1u<<20)
#define OTG_FS_OTG_HCCHAR1_EPTYP                                        (0x3u<<18)
#define OTG_FS_OTG_HCCHAR1_EPTYP_0                                      (0x1u<<18)
#define OTG_FS_OTG_HCCHAR1_LSDEV                                        (0x1u<<17)
#define OTG_FS_OTG_HCCHAR1_EPDIR                                        (0x1u<<15)
#define OTG_FS_OTG_HCCHAR1_EPNUM                                        (0xFu<<11)
#define OTG_FS_OTG_HCCHAR1_EPNUM_0                                      (0x1u<<11)
#define OTG_FS_OTG_HCCHAR1_MPSIZ                                        (0x7FFu<<0)
#define OTG_FS_OTG_HCCHAR1_MPSIZ_0                                      (0x1u<<0)

#define OTG_FS_OTG_HCCHAR1_CHENA_B_0X0                                  (0x0u<<31)
#define OTG_FS_OTG_HCCHAR1_CHENA_B_0X1                                  (0x1u<<31)
#define OTG_FS_OTG_HCCHAR1_ODDFRM_B_0X0                                 (0x0u<<29)
#define OTG_FS_OTG_HCCHAR1_ODDFRM_B_0X1                                 (0x1u<<29)
#define OTG_FS_OTG_HCCHAR1_MCNT_B_0X0                                   (0x0u<<20)
#define OTG_FS_OTG_HCCHAR1_MCNT_B_0X1                                   (0x1u<<20)
#define OTG_FS_OTG_HCCHAR1_MCNT_B_0X2                                   (0x2u<<20)
#define OTG_FS_OTG_HCCHAR1_MCNT_B_0X3                                   (0x3u<<20)
#define OTG_FS_OTG_HCCHAR1_EPTYP_B_0X0                                  (0x0u<<18)
#define OTG_FS_OTG_HCCHAR1_EPTYP_B_0X1                                  (0x1u<<18)
#define OTG_FS_OTG_HCCHAR1_EPTYP_B_0X2                                  (0x2u<<18)
#define OTG_FS_OTG_HCCHAR1_EPTYP_B_0X3                                  (0x3u<<18)
#define OTG_FS_OTG_HCCHAR1_EPDIR_B_0X0                                  (0x0u<<15)
#define OTG_FS_OTG_HCCHAR1_EPDIR_B_0X1                                  (0x1u<<15)

// OTG_HCINT1 Configuration

#define OTG_FS_OTG_HCINT1_DTERR                                         (0x1u<<10)
#define OTG_FS_OTG_HCINT1_FRMOR                                         (0x1u<<9)
#define OTG_FS_OTG_HCINT1_BBERR                                         (0x1u<<8)
#define OTG_FS_OTG_HCINT1_TXERR                                         (0x1u<<7)
#define OTG_FS_OTG_HCINT1_ACK                                           (0x1u<<5)
#define OTG_FS_OTG_HCINT1_NAK                                           (0x1u<<4)
#define OTG_FS_OTG_HCINT1_STALL                                         (0x1u<<3)
#define OTG_FS_OTG_HCINT1_CHH                                           (0x1u<<1)
#define OTG_FS_OTG_HCINT1_XFRC                                          (0x1u<<0)

// OTG_HCINTMSK1 Configuration

#define OTG_FS_OTG_HCINTMSK1_DTERRM                                     (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK1_FRMORM                                     (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK1_BBERRM                                     (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK1_TXERRM                                     (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK1_ACKM                                       (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK1_NAKM                                       (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK1_STALLM                                     (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK1_CHHM                                       (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK1_XFRCM                                      (0x1u<<0)

#define OTG_FS_OTG_HCINTMSK1_DTERRM_B_0X0                               (0x0u<<10)
#define OTG_FS_OTG_HCINTMSK1_DTERRM_B_0X1                               (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK1_FRMORM_B_0X0                               (0x0u<<9)
#define OTG_FS_OTG_HCINTMSK1_FRMORM_B_0X1                               (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK1_BBERRM_B_0X0                               (0x0u<<8)
#define OTG_FS_OTG_HCINTMSK1_BBERRM_B_0X1                               (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK1_TXERRM_B_0X0                               (0x0u<<7)
#define OTG_FS_OTG_HCINTMSK1_TXERRM_B_0X1                               (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK1_ACKM_B_0X0                                 (0x0u<<5)
#define OTG_FS_OTG_HCINTMSK1_ACKM_B_0X1                                 (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK1_NAKM_B_0X0                                 (0x0u<<4)
#define OTG_FS_OTG_HCINTMSK1_NAKM_B_0X1                                 (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK1_STALLM_B_0X0                               (0x0u<<3)
#define OTG_FS_OTG_HCINTMSK1_STALLM_B_0X1                               (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK1_CHHM_B_0X0                                 (0x0u<<1)
#define OTG_FS_OTG_HCINTMSK1_CHHM_B_0X1                                 (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK1_XFRCM_B_0X0                                (0x0u<<0)
#define OTG_FS_OTG_HCINTMSK1_XFRCM_B_0X1                                (0x1u<<0)

// OTG_HCTSIZ1 Configuration

#define OTG_FS_OTG_HCTSIZ1_DOPNG                                        (0x1u<<31)
#define OTG_FS_OTG_HCTSIZ1_DPID                                         (0x3u<<29)
#define OTG_FS_OTG_HCTSIZ1_DPID_0                                       (0x1u<<29)
#define OTG_FS_OTG_HCTSIZ1_PKTCNT                                       (0x3FFu<<19)
#define OTG_FS_OTG_HCTSIZ1_PKTCNT_0                                     (0x1u<<19)
#define OTG_FS_OTG_HCTSIZ1_XFRSIZ                                       (0x7FFFFu<<0)
#define OTG_FS_OTG_HCTSIZ1_XFRSIZ_0                                     (0x1u<<0)

#define OTG_FS_OTG_HCTSIZ1_DPID_B_0X0                                   (0x0u<<29)
#define OTG_FS_OTG_HCTSIZ1_DPID_B_0X2                                   (0x2u<<29)
#define OTG_FS_OTG_HCTSIZ1_DPID_B_0X3                                   (0x3u<<29)

// OTG_HCCHAR2 Configuration

#define OTG_FS_OTG_HCCHAR2_CHENA                                        (0x1u<<31)
#define OTG_FS_OTG_HCCHAR2_CHDIS                                        (0x1u<<30)
#define OTG_FS_OTG_HCCHAR2_ODDFRM                                       (0x1u<<29)
#define OTG_FS_OTG_HCCHAR2_DAD                                          (0x7Fu<<22)
#define OTG_FS_OTG_HCCHAR2_DAD_0                                        (0x1u<<22)
#define OTG_FS_OTG_HCCHAR2_MCNT                                         (0x3u<<20)
#define OTG_FS_OTG_HCCHAR2_MCNT_0                                       (0x1u<<20)
#define OTG_FS_OTG_HCCHAR2_EPTYP                                        (0x3u<<18)
#define OTG_FS_OTG_HCCHAR2_EPTYP_0                                      (0x1u<<18)
#define OTG_FS_OTG_HCCHAR2_LSDEV                                        (0x1u<<17)
#define OTG_FS_OTG_HCCHAR2_EPDIR                                        (0x1u<<15)
#define OTG_FS_OTG_HCCHAR2_EPNUM                                        (0xFu<<11)
#define OTG_FS_OTG_HCCHAR2_EPNUM_0                                      (0x1u<<11)
#define OTG_FS_OTG_HCCHAR2_MPSIZ                                        (0x7FFu<<0)
#define OTG_FS_OTG_HCCHAR2_MPSIZ_0                                      (0x1u<<0)

#define OTG_FS_OTG_HCCHAR2_CHENA_B_0X0                                  (0x0u<<31)
#define OTG_FS_OTG_HCCHAR2_CHENA_B_0X1                                  (0x1u<<31)
#define OTG_FS_OTG_HCCHAR2_ODDFRM_B_0X0                                 (0x0u<<29)
#define OTG_FS_OTG_HCCHAR2_ODDFRM_B_0X1                                 (0x1u<<29)
#define OTG_FS_OTG_HCCHAR2_MCNT_B_0X0                                   (0x0u<<20)
#define OTG_FS_OTG_HCCHAR2_MCNT_B_0X1                                   (0x1u<<20)
#define OTG_FS_OTG_HCCHAR2_MCNT_B_0X2                                   (0x2u<<20)
#define OTG_FS_OTG_HCCHAR2_MCNT_B_0X3                                   (0x3u<<20)
#define OTG_FS_OTG_HCCHAR2_EPTYP_B_0X0                                  (0x0u<<18)
#define OTG_FS_OTG_HCCHAR2_EPTYP_B_0X1                                  (0x1u<<18)
#define OTG_FS_OTG_HCCHAR2_EPTYP_B_0X2                                  (0x2u<<18)
#define OTG_FS_OTG_HCCHAR2_EPTYP_B_0X3                                  (0x3u<<18)
#define OTG_FS_OTG_HCCHAR2_EPDIR_B_0X0                                  (0x0u<<15)
#define OTG_FS_OTG_HCCHAR2_EPDIR_B_0X1                                  (0x1u<<15)

