Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg_fs.h
// OTG_HCINT3 Configuration

#define OTG_FS_OTG_HCINT3_DTERR                                         (0x1u<<10)
#define OTG_FS_OTG_HCINT3_FRMOR                                         (0x1u<<9)
#define OTG_FS_OTG_HCINT3_BBERR                                         (0x1u<<8)
#define OTG_FS_OTG_HCINT3_TXERR                                         (0x1u<<7)
#define OTG_FS_OTG_HCINT3_ACK                                           (0x1u<<5)
#define OTG_FS_OTG_HCINT3_NAK                                           (0x1u<<4)
#define OTG_FS_OTG_HCINT3_STALL                                         (0x1u<<3)
#define OTG_FS_OTG_HCINT3_CHH                                           (0x1u<<1)
#define OTG_FS_OTG_HCINT3_XFRC                                          (0x1u<<0)

// OTG_HCINTMSK3 Configuration

#define OTG_FS_OTG_HCINTMSK3_DTERRM                                     (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK3_FRMORM                                     (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK3_BBERRM                                     (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK3_TXERRM                                     (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK3_ACKM                                       (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK3_NAKM                                       (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK3_STALLM                                     (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK3_CHHM                                       (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK3_XFRCM                                      (0x1u<<0)

#define OTG_FS_OTG_HCINTMSK3_DTERRM_B_0X0                               (0x0u<<10)
#define OTG_FS_OTG_HCINTMSK3_DTERRM_B_0X1                               (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK3_FRMORM_B_0X0                               (0x0u<<9)
#define OTG_FS_OTG_HCINTMSK3_FRMORM_B_0X1                               (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK3_BBERRM_B_0X0                               (0x0u<<8)
#define OTG_FS_OTG_HCINTMSK3_BBERRM_B_0X1                               (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK3_TXERRM_B_0X0                               (0x0u<<7)
#define OTG_FS_OTG_HCINTMSK3_TXERRM_B_0X1                               (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK3_ACKM_B_0X0                                 (0x0u<<5)
#define OTG_FS_OTG_HCINTMSK3_ACKM_B_0X1                                 (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK3_NAKM_B_0X0                                 (0x0u<<4)
#define OTG_FS_OTG_HCINTMSK3_NAKM_B_0X1                                 (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK3_STALLM_B_0X0                               (0x0u<<3)
#define OTG_FS_OTG_HCINTMSK3_STALLM_B_0X1                               (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK3_CHHM_B_0X0                                 (0x0u<<1)
#define OTG_FS_OTG_HCINTMSK3_CHHM_B_0X1                                 (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK3_XFRCM_B_0X0                                (0x0u<<0)
#define OTG_FS_OTG_HCINTMSK3_XFRCM_B_0X1                                (0x1u<<0)

// OTG_HCTSIZ3 Configuration

#define OTG_FS_OTG_HCTSIZ3_DOPNG                                        (0x1u<<31)
#define OTG_FS_OTG_HCTSIZ3_DPID                                         (0x3u<<29)
#define OTG_FS_OTG_HCTSIZ3_DPID_0                                       (0x1u<<29)
#define OTG_FS_OTG_HCTSIZ3_PKTCNT                                       (0x3FFu<<19)
#define OTG_FS_OTG_HCTSIZ3_PKTCNT_0                                     (0x1u<<19)
#define OTG_FS_OTG_HCTSIZ3_XFRSIZ                                       (0x7FFFFu<<0)
#define OTG_FS_OTG_HCTSIZ3_XFRSIZ_0                                     (0x1u<<0)

#define OTG_FS_OTG_HCTSIZ3_DPID_B_0X0                                   (0x0u<<29)
#define OTG_FS_OTG_HCTSIZ3_DPID_B_0X2                                   (0x2u<<29)
#define OTG_FS_OTG_HCTSIZ3_DPID_B_0X3                                   (0x3u<<29)

// OTG_HCCHAR4 Configuration

#define OTG_FS_OTG_HCCHAR4_CHENA                                        (0x1u<<31)
#define OTG_FS_OTG_HCCHAR4_CHDIS                                        (0x1u<<30)
#define OTG_FS_OTG_HCCHAR4_ODDFRM                                       (0x1u<<29)
#define OTG_FS_OTG_HCCHAR4_DAD                                          (0x7Fu<<22)
#define OTG_FS_OTG_HCCHAR4_DAD_0                                        (0x1u<<22)
#define OTG_FS_OTG_HCCHAR4_MCNT                                         (0x3u<<20)
#define OTG_FS_OTG_HCCHAR4_MCNT_0                                       (0x1u<<20)
#define OTG_FS_OTG_HCCHAR4_EPTYP                                        (0x3u<<18)
#define OTG_FS_OTG_HCCHAR4_EPTYP_0                                      (0x1u<<18)
#define OTG_FS_OTG_HCCHAR4_LSDEV                                        (0x1u<<17)
#define OTG_FS_OTG_HCCHAR4_EPDIR                                        (0x1u<<15)
#define OTG_FS_OTG_HCCHAR4_EPNUM                                        (0xFu<<11)
#define OTG_FS_OTG_HCCHAR4_EPNUM_0                                      (0x1u<<11)
#define OTG_FS_OTG_HCCHAR4_MPSIZ                                        (0x7FFu<<0)
#define OTG_FS_OTG_HCCHAR4_MPSIZ_0                                      (0x1u<<0)

#define OTG_FS_OTG_HCCHAR4_CHENA_B_0X0                                  (0x0u<<31)
#define OTG_FS_OTG_HCCHAR4_CHENA_B_0X1                                  (0x1u<<31)
#define OTG_FS_OTG_HCCHAR4_ODDFRM_B_0X0                                 (0x0u<<29)
#define OTG_FS_OTG_HCCHAR4_ODDFRM_B_0X1                                 (0x1u<<29)
#define OTG_FS_OTG_HCCHAR4_MCNT_B_0X0                                   (0x0u<<20)
#define OTG_FS_OTG_HCCHAR4_MCNT_B_0X1                                   (0x1u<<20)
#define OTG_FS_OTG_HCCHAR4_MCNT_B_0X2                                   (0x2u<<20)
#define OTG_FS_OTG_HCCHAR4_MCNT_B_0X3                                   (0x3u<<20)
#define OTG_FS_OTG_HCCHAR4_EPTYP_B_0X0                                  (0x0u<<18)
#define OTG_FS_OTG_HCCHAR4_EPTYP_B_0X1                                  (0x1u<<18)
#define OTG_FS_OTG_HCCHAR4_EPTYP_B_0X2                                  (0x2u<<18)
#define OTG_FS_OTG_HCCHAR4_EPTYP_B_0X3                                  (0x3u<<18)
#define OTG_FS_OTG_HCCHAR4_EPDIR_B_0X0                                  (0x0u<<15)
#define OTG_FS_OTG_HCCHAR4_EPDIR_B_0X1                                  (0x1u<<15)

// OTG_HCINT4 Configuration

#define OTG_FS_OTG_HCINT4_DTERR                                         (0x1u<<10)
#define OTG_FS_OTG_HCINT4_FRMOR                                         (0x1u<<9)
#define OTG_FS_OTG_HCINT4_BBERR                                         (0x1u<<8)
#define OTG_FS_OTG_HCINT4_TXERR                                         (0x1u<<7)
#define OTG_FS_OTG_HCINT4_ACK                                           (0x1u<<5)
#define OTG_FS_OTG_HCINT4_NAK                                           (0x1u<<4)
#define OTG_FS_OTG_HCINT4_STALL                                         (0x1u<<3)
#define OTG_FS_OTG_HCINT4_CHH                                           (0x1u<<1)
#define OTG_FS_OTG_HCINT4_XFRC                                          (0x1u<<0)

// OTG_HCINTMSK4 Configuration

#define OTG_FS_OTG_HCINTMSK4_DTERRM                                     (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK4_FRMORM                                     (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK4_BBERRM                                     (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK4_TXERRM                                     (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK4_ACKM                                       (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK4_NAKM                                       (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK4_STALLM                                     (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK4_CHHM                                       (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK4_XFRCM                                      (0x1u<<0)

#define OTG_FS_OTG_HCINTMSK4_DTERRM_B_0X0                               (0x0u<<10)
#define OTG_FS_OTG_HCINTMSK4_DTERRM_B_0X1                               (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK4_FRMORM_B_0X0                               (0x0u<<9)
#define OTG_FS_OTG_HCINTMSK4_FRMORM_B_0X1                               (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK4_BBERRM_B_0X0                               (0x0u<<8)
#define OTG_FS_OTG_HCINTMSK4_BBERRM_B_0X1                               (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK4_TXERRM_B_0X0                               (0x0u<<7)
#define OTG_FS_OTG_HCINTMSK4_TXERRM_B_0X1                               (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK4_ACKM_B_0X0                                 (0x0u<<5)
#define OTG_FS_OTG_HCINTMSK4_ACKM_B_0X1                                 (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK4_NAKM_B_0X0                                 (0x0u<<4)
#define OTG_FS_OTG_HCINTMSK4_NAKM_B_0X1                                 (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK4_STALLM_B_0X0                               (0x0u<<3)
#define OTG_FS_OTG_HCINTMSK4_STALLM_B_0X1                               (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK4_CHHM_B_0X0                                 (0x0u<<1)
#define OTG_FS_OTG_HCINTMSK4_CHHM_B_0X1                                 (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK4_XFRCM_B_0X0                                (0x0u<<0)
#define OTG_FS_OTG_HCINTMSK4_XFRCM_B_0X1                                (0x1u<<0)

// OTG_HCTSIZ4 Configuration

#define OTG_FS_OTG_HCTSIZ4_DOPNG                                        (0x1u<<31)
#define OTG_FS_OTG_HCTSIZ4_DPID                                         (0x3u<<29)
#define OTG_FS_OTG_HCTSIZ4_DPID_0                                       (0x1u<<29)
#define OTG_FS_OTG_HCTSIZ4_PKTCNT                                       (0x3FFu<<19)
#define OTG_FS_OTG_HCTSIZ4_PKTCNT_0                                     (0x1u<<19)
#define OTG_FS_OTG_HCTSIZ4_XFRSIZ                                       (0x7FFFFu<<0)
#define OTG_FS_OTG_HCTSIZ4_XFRSIZ_0                                     (0x1u<<0)

#define OTG_FS_OTG_HCTSIZ4_DPID_B_0X0                                   (0x0u<<29)
#define OTG_FS_OTG_HCTSIZ4_DPID_B_0X2                                   (0x2u<<29)
#define OTG_FS_OTG_HCTSIZ4_DPID_B_0X3                                   (0x3u<<29)

