Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg_fs.h
// OTG_HCCHAR5 Configuration

#define OTG_FS_OTG_HCCHAR5_CHENA                                        (0x1u<<31)
#define OTG_FS_OTG_HCCHAR5_CHDIS                                        (0x1u<<30)
#define OTG_FS_OTG_HCCHAR5_ODDFRM                                       (0x1u<<29)
#define OTG_FS_OTG_HCCHAR5_DAD                                          (0x7Fu<<22)
#define OTG_FS_OTG_HCCHAR5_DAD_0                                        (0x1u<<22)
#define OTG_FS_OTG_HCCHAR5_MCNT                                         (0x3u<<20)
#define OTG_FS_OTG_HCCHAR5_MCNT_0                                       (0x1u<<20)
#define OTG_FS_OTG_HCCHAR5_EPTYP                                        (0x3u<<18)
#define OTG_FS_OTG_HCCHAR5_EPTYP_0                                      (0x1u<<18)
#define OTG_FS_OTG_HCCHAR5_LSDEV                                        (0x1u<<17)
#define OTG_FS_OTG_HCCHAR5_EPDIR                                        (0x1u<<15)
#define OTG_FS_OTG_HCCHAR5_EPNUM                                        (0xFu<<11)
#define OTG_FS_OTG_HCCHAR5_EPNUM_0                                      (0x1u<<11)
#define OTG_FS_OTG_HCCHAR5_MPSIZ                                        (0x7FFu<<0)
#define OTG_FS_OTG_HCCHAR5_MPSIZ_0                                      (0x1u<<0)

#define OTG_FS_OTG_HCCHAR5_CHENA_B_0X0                                  (0x0u<<31)
#define OTG_FS_OTG_HCCHAR5_CHENA_B_0X1                                  (0x1u<<31)
#define OTG_FS_OTG_HCCHAR5_ODDFRM_B_0X0                                 (0x0u<<29)
#define OTG_FS_OTG_HCCHAR5_ODDFRM_B_0X1                                 (0x1u<<29)
#define OTG_FS_OTG_HCCHAR5_MCNT_B_0X0                                   (0x0u<<20)
#define OTG_FS_OTG_HCCHAR5_MCNT_B_0X1                                   (0x1u<<20)
#define OTG_FS_OTG_HCCHAR5_MCNT_B_0X2                                   (0x2u<<20)
#define OTG_FS_OTG_HCCHAR5_MCNT_B_0X3                                   (0x3u<<20)
#define OTG_FS_OTG_HCCHAR5_EPTYP_B_0X0                                  (0x0u<<18)
#define OTG_FS_OTG_HCCHAR5_EPTYP_B_0X1                                  (0x1u<<18)
#define OTG_FS_OTG_HCCHAR5_EPTYP_B_0X2                                  (0x2u<<18)
#define OTG_FS_OTG_HCCHAR5_EPTYP_B_0X3                                  (0x3u<<18)
#define OTG_FS_OTG_HCCHAR5_EPDIR_B_0X0                                  (0x0u<<15)
#define OTG_FS_OTG_HCCHAR5_EPDIR_B_0X1                                  (0x1u<<15)

// OTG_HCINT5 Configuration

#define OTG_FS_OTG_HCINT5_DTERR                                         (0x1u<<10)
#define OTG_FS_OTG_HCINT5_FRMOR                                         (0x1u<<9)
#define OTG_FS_OTG_HCINT5_BBERR                                         (0x1u<<8)
#define OTG_FS_OTG_HCINT5_TXERR                                         (0x1u<<7)
#define OTG_FS_OTG_HCINT5_ACK                                           (0x1u<<5)
#define OTG_FS_OTG_HCINT5_NAK                                           (0x1u<<4)
#define OTG_FS_OTG_HCINT5_STALL                                         (0x1u<<3)
#define OTG_FS_OTG_HCINT5_CHH                                           (0x1u<<1)
#define OTG_FS_OTG_HCINT5_XFRC                                          (0x1u<<0)

// OTG_HCINTMSK5 Configuration

#define OTG_FS_OTG_HCINTMSK5_DTERRM                                     (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK5_FRMORM                                     (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK5_BBERRM                                     (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK5_TXERRM                                     (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK5_ACKM                                       (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK5_NAKM                                       (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK5_STALLM                                     (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK5_CHHM                                       (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK5_XFRCM                                      (0x1u<<0)

#define OTG_FS_OTG_HCINTMSK5_DTERRM_B_0X0                               (0x0u<<10)
#define OTG_FS_OTG_HCINTMSK5_DTERRM_B_0X1                               (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK5_FRMORM_B_0X0                               (0x0u<<9)
#define OTG_FS_OTG_HCINTMSK5_FRMORM_B_0X1                               (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK5_BBERRM_B_0X0                               (0x0u<<8)
#define OTG_FS_OTG_HCINTMSK5_BBERRM_B_0X1                               (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK5_TXERRM_B_0X0                               (0x0u<<7)
#define OTG_FS_OTG_HCINTMSK5_TXERRM_B_0X1                               (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK5_ACKM_B_0X0                                 (0x0u<<5)
#define OTG_FS_OTG_HCINTMSK5_ACKM_B_0X1                                 (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK5_NAKM_B_0X0                                 (0x0u<<4)
#define OTG_FS_OTG_HCINTMSK5_NAKM_B_0X1                                 (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK5_STALLM_B_0X0                               (0x0u<<3)
#define OTG_FS_OTG_HCINTMSK5_STALLM_B_0X1                               (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK5_CHHM_B_0X0                                 (0x0u<<1)
#define OTG_FS_OTG_HCINTMSK5_CHHM_B_0X1                                 (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK5_XFRCM_B_0X0                                (0x0u<<0)
#define OTG_FS_OTG_HCINTMSK5_XFRCM_B_0X1                                (0x1u<<0)

// OTG_HCTSIZ5 Configuration

#define OTG_FS_OTG_HCTSIZ5_DOPNG                                        (0x1u<<31)
#define OTG_FS_OTG_HCTSIZ5_DPID                                         (0x3u<<29)
#define OTG_FS_OTG_HCTSIZ5_DPID_0                                       (0x1u<<29)
#define OTG_FS_OTG_HCTSIZ5_PKTCNT                                       (0x3FFu<<19)
#define OTG_FS_OTG_HCTSIZ5_PKTCNT_0                                     (0x1u<<19)
#define OTG_FS_OTG_HCTSIZ5_XFRSIZ                                       (0x7FFFFu<<0)
#define OTG_FS_OTG_HCTSIZ5_XFRSIZ_0                                     (0x1u<<0)

#define OTG_FS_OTG_HCTSIZ5_DPID_B_0X0                                   (0x0u<<29)
#define OTG_FS_OTG_HCTSIZ5_DPID_B_0X2                                   (0x2u<<29)
#define OTG_FS_OTG_HCTSIZ5_DPID_B_0X3                                   (0x3u<<29)

// OTG_HCCHAR6 Configuration

#define OTG_FS_OTG_HCCHAR6_CHENA                                        (0x1u<<31)
#define OTG_FS_OTG_HCCHAR6_CHDIS                                        (0x1u<<30)
#define OTG_FS_OTG_HCCHAR6_ODDFRM                                       (0x1u<<29)
#define OTG_FS_OTG_HCCHAR6_DAD                                          (0x7Fu<<22)
#define OTG_FS_OTG_HCCHAR6_DAD_0                                        (0x1u<<22)
#define OTG_FS_OTG_HCCHAR6_MCNT                                         (0x3u<<20)
#define OTG_FS_OTG_HCCHAR6_MCNT_0                                       (0x1u<<20)
#define OTG_FS_OTG_HCCHAR6_EPTYP                                        (0x3u<<18)
#define OTG_FS_OTG_HCCHAR6_EPTYP_0                                      (0x1u<<18)
#define OTG_FS_OTG_HCCHAR6_LSDEV                                        (0x1u<<17)
#define OTG_FS_OTG_HCCHAR6_EPDIR                                        (0x1u<<15)
#define OTG_FS_OTG_HCCHAR6_EPNUM                                        (0xFu<<11)
#define OTG_FS_OTG_HCCHAR6_EPNUM_0                                      (0x1u<<11)
#define OTG_FS_OTG_HCCHAR6_MPSIZ                                        (0x7FFu<<0)
#define OTG_FS_OTG_HCCHAR6_MPSIZ_0                                      (0x1u<<0)

#define OTG_FS_OTG_HCCHAR6_CHENA_B_0X0                                  (0x0u<<31)
#define OTG_FS_OTG_HCCHAR6_CHENA_B_0X1                                  (0x1u<<31)
#define OTG_FS_OTG_HCCHAR6_ODDFRM_B_0X0                                 (0x0u<<29)
#define OTG_FS_OTG_HCCHAR6_ODDFRM_B_0X1                                 (0x1u<<29)
#define OTG_FS_OTG_HCCHAR6_MCNT_B_0X0                                   (0x0u<<20)
#define OTG_FS_OTG_HCCHAR6_MCNT_B_0X1                                   (0x1u<<20)
#define OTG_FS_OTG_HCCHAR6_MCNT_B_0X2                                   (0x2u<<20)
#define OTG_FS_OTG_HCCHAR6_MCNT_B_0X3                                   (0x3u<<20)
#define OTG_FS_OTG_HCCHAR6_EPTYP_B_0X0                                  (0x0u<<18)
#define OTG_FS_OTG_HCCHAR6_EPTYP_B_0X1                                  (0x1u<<18)
#define OTG_FS_OTG_HCCHAR6_EPTYP_B_0X2                                  (0x2u<<18)
#define OTG_FS_OTG_HCCHAR6_EPTYP_B_0X3                                  (0x3u<<18)
#define OTG_FS_OTG_HCCHAR6_EPDIR_B_0X0                                  (0x0u<<15)
#define OTG_FS_OTG_HCCHAR6_EPDIR_B_0X1                                  (0x1u<<15)

// OTG_HCINT6 Configuration

#define OTG_FS_OTG_HCINT6_DTERR                                         (0x1u<<10)
#define OTG_FS_OTG_HCINT6_FRMOR                                         (0x1u<<9)
#define OTG_FS_OTG_HCINT6_BBERR                                         (0x1u<<8)
#define OTG_FS_OTG_HCINT6_TXERR                                         (0x1u<<7)
#define OTG_FS_OTG_HCINT6_ACK                                           (0x1u<<5)
#define OTG_FS_OTG_HCINT6_NAK                                           (0x1u<<4)
#define OTG_FS_OTG_HCINT6_STALL                                         (0x1u<<3)
#define OTG_FS_OTG_HCINT6_CHH                                           (0x1u<<1)
#define OTG_FS_OTG_HCINT6_XFRC                                          (0x1u<<0)

// OTG_HCINTMSK6 Configuration

#define OTG_FS_OTG_HCINTMSK6_DTERRM                                     (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK6_FRMORM                                     (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK6_BBERRM                                     (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK6_TXERRM                                     (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK6_ACKM                                       (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK6_NAKM                                       (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK6_STALLM                                     (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK6_CHHM                                       (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK6_XFRCM                                      (0x1u<<0)

#define OTG_FS_OTG_HCINTMSK6_DTERRM_B_0X0                               (0x0u<<10)
#define OTG_FS_OTG_HCINTMSK6_DTERRM_B_0X1                               (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK6_FRMORM_B_0X0                               (0x0u<<9)
#define OTG_FS_OTG_HCINTMSK6_FRMORM_B_0X1                               (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK6_BBERRM_B_0X0                               (0x0u<<8)
#define OTG_FS_OTG_HCINTMSK6_BBERRM_B_0X1                               (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK6_TXERRM_B_0X0                               (0x0u<<7)
#define OTG_FS_OTG_HCINTMSK6_TXERRM_B_0X1                               (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK6_ACKM_B_0X0                                 (0x0u<<5)
#define OTG_FS_OTG_HCINTMSK6_ACKM_B_0X1                                 (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK6_NAKM_B_0X0                                 (0x0u<<4)
#define OTG_FS_OTG_HCINTMSK6_NAKM_B_0X1                                 (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK6_STALLM_B_0X0                               (0x0u<<3)
#define OTG_FS_OTG_HCINTMSK6_STALLM_B_0X1                               (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK6_CHHM_B_0X0                                 (0x0u<<1)
#define OTG_FS_OTG_HCINTMSK6_CHHM_B_0X1                                 (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK6_XFRCM_B_0X0                                (0x0u<<0)
#define OTG_FS_OTG_HCINTMSK6_XFRCM_B_0X1                                (0x1u<<0)

// OTG_HCTSIZ6 Configuration

#define OTG_FS_OTG_HCTSIZ6_DOPNG                                        (0x1u<<31)
#define OTG_FS_OTG_HCTSIZ6_DPID                                         (0x3u<<29)
#define OTG_FS_OTG_HCTSIZ6_DPID_0                                       (0x1u<<29)
#define OTG_FS_OTG_HCTSIZ6_PKTCNT                                       (0x3FFu<<19)
#define OTG_FS_OTG_HCTSIZ6_PKTCNT_0                                     (0x1u<<19)
#define OTG_FS_OTG_HCTSIZ6_XFRSIZ                                       (0x7FFFFu<<0)
#define OTG_FS_OTG_HCTSIZ6_XFRSIZ_0                                     (0x1u<<0)

#define OTG_FS_OTG_HCTSIZ6_DPID_B_0X0                                   (0x0u<<29)
#define OTG_FS_OTG_HCTSIZ6_DPID_B_0X2                                   (0x2u<<29)
#define OTG_FS_OTG_HCTSIZ6_DPID_B_0X3                                   (0x3u<<29)

// OTG_HCCHAR7 Configuration

#define OTG_FS_OTG_HCCHAR7_CHENA                                        (0x1u<<31)
#define OTG_FS_OTG_HCCHAR7_CHDIS                                        (0x1u<<30)
#define OTG_FS_OTG_HCCHAR7_ODDFRM                                       (0x1u<<29)
#define OTG_FS_OTG_HCCHAR7_DAD                                          (0x7Fu<<22)
#define OTG_FS_OTG_HCCHAR7_DAD_0                                        (0x1u<<22)
#define OTG_FS_OTG_HCCHAR7_MCNT                                         (0x3u<<20)
#define OTG_FS_OTG_HCCHAR7_MCNT_0                                       (0x1u<<20)
#define OTG_FS_OTG_HCCHAR7_EPTYP                                        (0x3u<<18)
#define OTG_FS_OTG_HCCHAR7_EPTYP_0                                      (0x1u<<18)
#define OTG_FS_OTG_HCCHAR7_LSDEV                                        (0x1u<<17)
#define OTG_FS_OTG_HCCHAR7_EPDIR                                        (0x1u<<15)
#define OTG_FS_OTG_HCCHAR7_EPNUM                                        (0xFu<<11)
#define OTG_FS_OTG_HCCHAR7_EPNUM_0                                      (0x1u<<11)
#define OTG_FS_OTG_HCCHAR7_MPSIZ                                        (0x7FFu<<0)
#define OTG_FS_OTG_HCCHAR7_MPSIZ_0                                      (0x1u<<0)

#define OTG_FS_OTG_HCCHAR7_CHENA_B_0X0                                  (0x0u<<31)
#define OTG_FS_OTG_HCCHAR7_CHENA_B_0X1                                  (0x1u<<31)
#define OTG_FS_OTG_HCCHAR7_ODDFRM_B_0X0                                 (0x0u<<29)
#define OTG_FS_OTG_HCCHAR7_ODDFRM_B_0X1                                 (0x1u<<29)
#define OTG_FS_OTG_HCCHAR7_MCNT_B_0X0                                   (0x0u<<20)
#define OTG_FS_OTG_HCCHAR7_MCNT_B_0X1                                   (0x1u<<20)
#define OTG_FS_OTG_HCCHAR7_MCNT_B_0X2                                   (0x2u<<20)
#define OTG_FS_OTG_HCCHAR7_MCNT_B_0X3                                   (0x3u<<20)
#define OTG_FS_OTG_HCCHAR7_EPTYP_B_0X0                                  (0x0u<<18)
#define OTG_FS_OTG_HCCHAR7_EPTYP_B_0X1                                  (0x1u<<18)
#define OTG_FS_OTG_HCCHAR7_EPTYP_B_0X2                                  (0x2u<<18)
#define OTG_FS_OTG_HCCHAR7_EPTYP_B_0X3                                  (0x3u<<18)
#define OTG_FS_OTG_HCCHAR7_EPDIR_B_0X0                                  (0x0u<<15)
#define OTG_FS_OTG_HCCHAR7_EPDIR_B_0X1                                  (0x1u<<15)

// OTG_HCINT7 Configuration

