Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg_fs.h
#define OTG_FS_OTG_HCINT7_DTERR                                         (0x1u<<10)
#define OTG_FS_OTG_HCINT7_FRMOR                                         (0x1u<<9)
#define OTG_FS_OTG_HCINT7_BBERR                                         (0x1u<<8)
#define OTG_FS_OTG_HCINT7_TXERR                                         (0x1u<<7)
#define OTG_FS_OTG_HCINT7_ACK                                           (0x1u<<5)
#define OTG_FS_OTG_HCINT7_NAK                                           (0x1u<<4)
#define OTG_FS_OTG_HCINT7_STALL                                         (0x1u<<3)
#define OTG_FS_OTG_HCINT7_CHH                                           (0x1u<<1)
#define OTG_FS_OTG_HCINT7_XFRC                                          (0x1u<<0)

// OTG_HCINTMSK7 Configuration

#define OTG_FS_OTG_HCINTMSK7_DTERRM                                     (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK7_FRMORM                                     (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK7_BBERRM                                     (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK7_TXERRM                                     (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK7_ACKM                                       (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK7_NAKM                                       (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK7_STALLM                                     (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK7_CHHM                                       (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK7_XFRCM                                      (0x1u<<0)

#define OTG_FS_OTG_HCINTMSK7_DTERRM_B_0X0                               (0x0u<<10)
#define OTG_FS_OTG_HCINTMSK7_DTERRM_B_0X1                               (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK7_FRMORM_B_0X0                               (0x0u<<9)
#define OTG_FS_OTG_HCINTMSK7_FRMORM_B_0X1                               (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK7_BBERRM_B_0X0                               (0x0u<<8)
#define OTG_FS_OTG_HCINTMSK7_BBERRM_B_0X1                               (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK7_TXERRM_B_0X0                               (0x0u<<7)
#define OTG_FS_OTG_HCINTMSK7_TXERRM_B_0X1                               (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK7_ACKM_B_0X0                                 (0x0u<<5)
#define OTG_FS_OTG_HCINTMSK7_ACKM_B_0X1                                 (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK7_NAKM_B_0X0                                 (0x0u<<4)
#define OTG_FS_OTG_HCINTMSK7_NAKM_B_0X1                                 (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK7_STALLM_B_0X0                               (0x0u<<3)
#define OTG_FS_OTG_HCINTMSK7_STALLM_B_0X1                               (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK7_CHHM_B_0X0                                 (0x0u<<1)
#define OTG_FS_OTG_HCINTMSK7_CHHM_B_0X1                                 (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK7_XFRCM_B_0X0                                (0x0u<<0)
#define OTG_FS_OTG_HCINTMSK7_XFRCM_B_0X1                                (0x1u<<0)

// OTG_HCTSIZ7 Configuration

#define OTG_FS_OTG_HCTSIZ7_DOPNG                                        (0x1u<<31)
#define OTG_FS_OTG_HCTSIZ7_DPID                                         (0x3u<<29)
#define OTG_FS_OTG_HCTSIZ7_DPID_0                                       (0x1u<<29)
#define OTG_FS_OTG_HCTSIZ7_PKTCNT                                       (0x3FFu<<19)
#define OTG_FS_OTG_HCTSIZ7_PKTCNT_0                                     (0x1u<<19)
#define OTG_FS_OTG_HCTSIZ7_XFRSIZ                                       (0x7FFFFu<<0)
#define OTG_FS_OTG_HCTSIZ7_XFRSIZ_0                                     (0x1u<<0)

#define OTG_FS_OTG_HCTSIZ7_DPID_B_0X0                                   (0x0u<<29)
#define OTG_FS_OTG_HCTSIZ7_DPID_B_0X2                                   (0x2u<<29)
#define OTG_FS_OTG_HCTSIZ7_DPID_B_0X3                                   (0x3u<<29)

// OTG_HCCHAR8 Configuration

#define OTG_FS_OTG_HCCHAR8_CHENA                                        (0x1u<<31)
#define OTG_FS_OTG_HCCHAR8_CHDIS                                        (0x1u<<30)
#define OTG_FS_OTG_HCCHAR8_ODDFRM                                       (0x1u<<29)
#define OTG_FS_OTG_HCCHAR8_DAD                                          (0x7Fu<<22)
#define OTG_FS_OTG_HCCHAR8_DAD_0                                        (0x1u<<22)
#define OTG_FS_OTG_HCCHAR8_MCNT                                         (0x3u<<20)
#define OTG_FS_OTG_HCCHAR8_MCNT_0                                       (0x1u<<20)
#define OTG_FS_OTG_HCCHAR8_EPTYP                                        (0x3u<<18)
#define OTG_FS_OTG_HCCHAR8_EPTYP_0                                      (0x1u<<18)
#define OTG_FS_OTG_HCCHAR8_LSDEV                                        (0x1u<<17)
#define OTG_FS_OTG_HCCHAR8_EPDIR                                        (0x1u<<15)
#define OTG_FS_OTG_HCCHAR8_EPNUM                                        (0xFu<<11)
#define OTG_FS_OTG_HCCHAR8_EPNUM_0                                      (0x1u<<11)
#define OTG_FS_OTG_HCCHAR8_MPSIZ                                        (0x7FFu<<0)
#define OTG_FS_OTG_HCCHAR8_MPSIZ_0                                      (0x1u<<0)

#define OTG_FS_OTG_HCCHAR8_CHENA_B_0X0                                  (0x0u<<31)
#define OTG_FS_OTG_HCCHAR8_CHENA_B_0X1                                  (0x1u<<31)
#define OTG_FS_OTG_HCCHAR8_ODDFRM_B_0X0                                 (0x0u<<29)
#define OTG_FS_OTG_HCCHAR8_ODDFRM_B_0X1                                 (0x1u<<29)
#define OTG_FS_OTG_HCCHAR8_MCNT_B_0X0                                   (0x0u<<20)
#define OTG_FS_OTG_HCCHAR8_MCNT_B_0X1                                   (0x1u<<20)
#define OTG_FS_OTG_HCCHAR8_MCNT_B_0X2                                   (0x2u<<20)
#define OTG_FS_OTG_HCCHAR8_MCNT_B_0X3                                   (0x3u<<20)
#define OTG_FS_OTG_HCCHAR8_EPTYP_B_0X0                                  (0x0u<<18)
#define OTG_FS_OTG_HCCHAR8_EPTYP_B_0X1                                  (0x1u<<18)
#define OTG_FS_OTG_HCCHAR8_EPTYP_B_0X2                                  (0x2u<<18)
#define OTG_FS_OTG_HCCHAR8_EPTYP_B_0X3                                  (0x3u<<18)
#define OTG_FS_OTG_HCCHAR8_EPDIR_B_0X0                                  (0x0u<<15)
#define OTG_FS_OTG_HCCHAR8_EPDIR_B_0X1                                  (0x1u<<15)

// OTG_HCINT8 Configuration

#define OTG_FS_OTG_HCINT8_DTERR                                         (0x1u<<10)
#define OTG_FS_OTG_HCINT8_FRMOR                                         (0x1u<<9)
#define OTG_FS_OTG_HCINT8_BBERR                                         (0x1u<<8)
#define OTG_FS_OTG_HCINT8_TXERR                                         (0x1u<<7)
#define OTG_FS_OTG_HCINT8_ACK                                           (0x1u<<5)
#define OTG_FS_OTG_HCINT8_NAK                                           (0x1u<<4)
#define OTG_FS_OTG_HCINT8_STALL                                         (0x1u<<3)
#define OTG_FS_OTG_HCINT8_CHH                                           (0x1u<<1)
#define OTG_FS_OTG_HCINT8_XFRC                                          (0x1u<<0)

// OTG_HCINTMSK8 Configuration

