Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg_fs.h
#define OTG_FS_OTG_HCINTMSK8_DTERRM                                     (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK8_FRMORM                                     (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK8_BBERRM                                     (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK8_TXERRM                                     (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK8_ACKM                                       (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK8_NAKM                                       (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK8_STALLM                                     (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK8_CHHM                                       (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK8_XFRCM                                      (0x1u<<0)

#define OTG_FS_OTG_HCINTMSK8_DTERRM_B_0X0                               (0x0u<<10)
#define OTG_FS_OTG_HCINTMSK8_DTERRM_B_0X1                               (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK8_FRMORM_B_0X0                               (0x0u<<9)
#define OTG_FS_OTG_HCINTMSK8_FRMORM_B_0X1                               (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK8_BBERRM_B_0X0                               (0x0u<<8)
#define OTG_FS_OTG_HCINTMSK8_BBERRM_B_0X1                               (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK8_TXERRM_B_0X0                               (0x0u<<7)
#define OTG_FS_OTG_HCINTMSK8_TXERRM_B_0X1                               (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK8_ACKM_B_0X0                                 (0x0u<<5)
#define OTG_FS_OTG_HCINTMSK8_ACKM_B_0X1                                 (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK8_NAKM_B_0X0                                 (0x0u<<4)
#define OTG_FS_OTG_HCINTMSK8_NAKM_B_0X1                                 (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK8_STALLM_B_0X0                               (0x0u<<3)
#define OTG_FS_OTG_HCINTMSK8_STALLM_B_0X1                               (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK8_CHHM_B_0X0                                 (0x0u<<1)
#define OTG_FS_OTG_HCINTMSK8_CHHM_B_0X1                                 (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK8_XFRCM_B_0X0                                (0x0u<<0)
#define OTG_FS_OTG_HCINTMSK8_XFRCM_B_0X1                                (0x1u<<0)

// OTG_HCTSIZ8 Configuration

#define OTG_FS_OTG_HCTSIZ8_DOPNG                                        (0x1u<<31)
#define OTG_FS_OTG_HCTSIZ8_DPID                                         (0x3u<<29)
#define OTG_FS_OTG_HCTSIZ8_DPID_0                                       (0x1u<<29)
#define OTG_FS_OTG_HCTSIZ8_PKTCNT                                       (0x3FFu<<19)
#define OTG_FS_OTG_HCTSIZ8_PKTCNT_0                                     (0x1u<<19)
#define OTG_FS_OTG_HCTSIZ8_XFRSIZ                                       (0x7FFFFu<<0)
#define OTG_FS_OTG_HCTSIZ8_XFRSIZ_0                                     (0x1u<<0)

#define OTG_FS_OTG_HCTSIZ8_DPID_B_0X0                                   (0x0u<<29)
#define OTG_FS_OTG_HCTSIZ8_DPID_B_0X2                                   (0x2u<<29)
#define OTG_FS_OTG_HCTSIZ8_DPID_B_0X3                                   (0x3u<<29)

// OTG_HCCHAR9 Configuration

#define OTG_FS_OTG_HCCHAR9_CHENA                                        (0x1u<<31)
#define OTG_FS_OTG_HCCHAR9_CHDIS                                        (0x1u<<30)
#define OTG_FS_OTG_HCCHAR9_ODDFRM                                       (0x1u<<29)
#define OTG_FS_OTG_HCCHAR9_DAD                                          (0x7Fu<<22)
#define OTG_FS_OTG_HCCHAR9_DAD_0                                        (0x1u<<22)
#define OTG_FS_OTG_HCCHAR9_MCNT                                         (0x3u<<20)
#define OTG_FS_OTG_HCCHAR9_MCNT_0                                       (0x1u<<20)
#define OTG_FS_OTG_HCCHAR9_EPTYP                                        (0x3u<<18)
#define OTG_FS_OTG_HCCHAR9_EPTYP_0                                      (0x1u<<18)
#define OTG_FS_OTG_HCCHAR9_LSDEV                                        (0x1u<<17)
#define OTG_FS_OTG_HCCHAR9_EPDIR                                        (0x1u<<15)
#define OTG_FS_OTG_HCCHAR9_EPNUM                                        (0xFu<<11)
#define OTG_FS_OTG_HCCHAR9_EPNUM_0                                      (0x1u<<11)
#define OTG_FS_OTG_HCCHAR9_MPSIZ                                        (0x7FFu<<0)
#define OTG_FS_OTG_HCCHAR9_MPSIZ_0                                      (0x1u<<0)

#define OTG_FS_OTG_HCCHAR9_CHENA_B_0X0                                  (0x0u<<31)
#define OTG_FS_OTG_HCCHAR9_CHENA_B_0X1                                  (0x1u<<31)
#define OTG_FS_OTG_HCCHAR9_ODDFRM_B_0X0                                 (0x0u<<29)
#define OTG_FS_OTG_HCCHAR9_ODDFRM_B_0X1                                 (0x1u<<29)
#define OTG_FS_OTG_HCCHAR9_MCNT_B_0X0                                   (0x0u<<20)
#define OTG_FS_OTG_HCCHAR9_MCNT_B_0X1                                   (0x1u<<20)
#define OTG_FS_OTG_HCCHAR9_MCNT_B_0X2                                   (0x2u<<20)
#define OTG_FS_OTG_HCCHAR9_MCNT_B_0X3                                   (0x3u<<20)
#define OTG_FS_OTG_HCCHAR9_EPTYP_B_0X0                                  (0x0u<<18)
#define OTG_FS_OTG_HCCHAR9_EPTYP_B_0X1                                  (0x1u<<18)
#define OTG_FS_OTG_HCCHAR9_EPTYP_B_0X2                                  (0x2u<<18)
#define OTG_FS_OTG_HCCHAR9_EPTYP_B_0X3                                  (0x3u<<18)
#define OTG_FS_OTG_HCCHAR9_EPDIR_B_0X0                                  (0x0u<<15)
#define OTG_FS_OTG_HCCHAR9_EPDIR_B_0X1                                  (0x1u<<15)

// OTG_HCINT9 Configuration

#define OTG_FS_OTG_HCINT9_DTERR                                         (0x1u<<10)
#define OTG_FS_OTG_HCINT9_FRMOR                                         (0x1u<<9)
#define OTG_FS_OTG_HCINT9_BBERR                                         (0x1u<<8)
#define OTG_FS_OTG_HCINT9_TXERR                                         (0x1u<<7)
#define OTG_FS_OTG_HCINT9_ACK                                           (0x1u<<5)
#define OTG_FS_OTG_HCINT9_NAK                                           (0x1u<<4)
#define OTG_FS_OTG_HCINT9_STALL                                         (0x1u<<3)
#define OTG_FS_OTG_HCINT9_CHH                                           (0x1u<<1)
#define OTG_FS_OTG_HCINT9_XFRC                                          (0x1u<<0)

// OTG_HCINTMSK9 Configuration

