Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg_fs.h
#define OTG_FS_OTG_HCINTMSK10_DTERRM                                    (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK10_FRMORM                                    (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK10_BBERRM                                    (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK10_TXERRM                                    (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK10_ACKM                                      (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK10_NAKM                                      (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK10_STALLM                                    (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK10_CHHM                                      (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK10_XFRCM                                     (0x1u<<0)

#define OTG_FS_OTG_HCINTMSK10_DTERRM_B_0X0                              (0x0u<<10)
#define OTG_FS_OTG_HCINTMSK10_DTERRM_B_0X1                              (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK10_FRMORM_B_0X0                              (0x0u<<9)
#define OTG_FS_OTG_HCINTMSK10_FRMORM_B_0X1                              (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK10_BBERRM_B_0X0                              (0x0u<<8)
#define OTG_FS_OTG_HCINTMSK10_BBERRM_B_0X1                              (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK10_TXERRM_B_0X0                              (0x0u<<7)
#define OTG_FS_OTG_HCINTMSK10_TXERRM_B_0X1                              (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK10_ACKM_B_0X0                                (0x0u<<5)
#define OTG_FS_OTG_HCINTMSK10_ACKM_B_0X1                                (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK10_NAKM_B_0X0                                (0x0u<<4)
#define OTG_FS_OTG_HCINTMSK10_NAKM_B_0X1                                (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK10_STALLM_B_0X0                              (0x0u<<3)
#define OTG_FS_OTG_HCINTMSK10_STALLM_B_0X1                              (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK10_CHHM_B_0X0                                (0x0u<<1)
#define OTG_FS_OTG_HCINTMSK10_CHHM_B_0X1                                (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK10_XFRCM_B_0X0                               (0x0u<<0)
#define OTG_FS_OTG_HCINTMSK10_XFRCM_B_0X1                               (0x1u<<0)

// OTG_HCTSIZ10 Configuration

#define OTG_FS_OTG_HCTSIZ10_DOPNG                                       (0x1u<<31)
#define OTG_FS_OTG_HCTSIZ10_DPID                                        (0x3u<<29)
#define OTG_FS_OTG_HCTSIZ10_DPID_0                                      (0x1u<<29)
#define OTG_FS_OTG_HCTSIZ10_PKTCNT                                      (0x3FFu<<19)
#define OTG_FS_OTG_HCTSIZ10_PKTCNT_0                                    (0x1u<<19)
#define OTG_FS_OTG_HCTSIZ10_XFRSIZ                                      (0x7FFFFu<<0)
#define OTG_FS_OTG_HCTSIZ10_XFRSIZ_0                                    (0x1u<<0)

#define OTG_FS_OTG_HCTSIZ10_DPID_B_0X0                                  (0x0u<<29)
#define OTG_FS_OTG_HCTSIZ10_DPID_B_0X2                                  (0x2u<<29)
#define OTG_FS_OTG_HCTSIZ10_DPID_B_0X3                                  (0x3u<<29)

// OTG_HCCHAR11 Configuration

#define OTG_FS_OTG_HCCHAR11_CHENA                                       (0x1u<<31)
#define OTG_FS_OTG_HCCHAR11_CHDIS                                       (0x1u<<30)
#define OTG_FS_OTG_HCCHAR11_ODDFRM                                      (0x1u<<29)
#define OTG_FS_OTG_HCCHAR11_DAD                                         (0x7Fu<<22)
#define OTG_FS_OTG_HCCHAR11_DAD_0                                       (0x1u<<22)
#define OTG_FS_OTG_HCCHAR11_MCNT                                        (0x3u<<20)
#define OTG_FS_OTG_HCCHAR11_MCNT_0                                      (0x1u<<20)
#define OTG_FS_OTG_HCCHAR11_EPTYP                                       (0x3u<<18)
#define OTG_FS_OTG_HCCHAR11_EPTYP_0                                     (0x1u<<18)
#define OTG_FS_OTG_HCCHAR11_LSDEV                                       (0x1u<<17)
#define OTG_FS_OTG_HCCHAR11_EPDIR                                       (0x1u<<15)
#define OTG_FS_OTG_HCCHAR11_EPNUM                                       (0xFu<<11)
#define OTG_FS_OTG_HCCHAR11_EPNUM_0                                     (0x1u<<11)
#define OTG_FS_OTG_HCCHAR11_MPSIZ                                       (0x7FFu<<0)
#define OTG_FS_OTG_HCCHAR11_MPSIZ_0                                     (0x1u<<0)

#define OTG_FS_OTG_HCCHAR11_CHENA_B_0X0                                 (0x0u<<31)
#define OTG_FS_OTG_HCCHAR11_CHENA_B_0X1                                 (0x1u<<31)
#define OTG_FS_OTG_HCCHAR11_ODDFRM_B_0X0                                (0x0u<<29)
#define OTG_FS_OTG_HCCHAR11_ODDFRM_B_0X1                                (0x1u<<29)
#define OTG_FS_OTG_HCCHAR11_MCNT_B_0X0                                  (0x0u<<20)
#define OTG_FS_OTG_HCCHAR11_MCNT_B_0X1                                  (0x1u<<20)
#define OTG_FS_OTG_HCCHAR11_MCNT_B_0X2                                  (0x2u<<20)
#define OTG_FS_OTG_HCCHAR11_MCNT_B_0X3                                  (0x3u<<20)
#define OTG_FS_OTG_HCCHAR11_EPTYP_B_0X0                                 (0x0u<<18)
#define OTG_FS_OTG_HCCHAR11_EPTYP_B_0X1                                 (0x1u<<18)
#define OTG_FS_OTG_HCCHAR11_EPTYP_B_0X2                                 (0x2u<<18)
#define OTG_FS_OTG_HCCHAR11_EPTYP_B_0X3                                 (0x3u<<18)
#define OTG_FS_OTG_HCCHAR11_EPDIR_B_0X0                                 (0x0u<<15)
#define OTG_FS_OTG_HCCHAR11_EPDIR_B_0X1                                 (0x1u<<15)

// OTG_HCINT11 Configuration

#define OTG_FS_OTG_HCINT11_DTERR                                        (0x1u<<10)
#define OTG_FS_OTG_HCINT11_FRMOR                                        (0x1u<<9)
#define OTG_FS_OTG_HCINT11_BBERR                                        (0x1u<<8)
#define OTG_FS_OTG_HCINT11_TXERR                                        (0x1u<<7)
#define OTG_FS_OTG_HCINT11_ACK                                          (0x1u<<5)
#define OTG_FS_OTG_HCINT11_NAK                                          (0x1u<<4)
#define OTG_FS_OTG_HCINT11_STALL                                        (0x1u<<3)
#define OTG_FS_OTG_HCINT11_CHH                                          (0x1u<<1)
#define OTG_FS_OTG_HCINT11_XFRC                                         (0x1u<<0)

// OTG_HCINTMSK11 Configuration

#define OTG_FS_OTG_HCINTMSK11_DTERRM                                    (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK11_FRMORM                                    (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK11_BBERRM                                    (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK11_TXERRM                                    (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK11_ACKM                                      (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK11_NAKM                                      (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK11_STALLM                                    (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK11_CHHM                                      (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK11_XFRCM                                     (0x1u<<0)

#define OTG_FS_OTG_HCINTMSK11_DTERRM_B_0X0                              (0x0u<<10)
#define OTG_FS_OTG_HCINTMSK11_DTERRM_B_0X1                              (0x1u<<10)
#define OTG_FS_OTG_HCINTMSK11_FRMORM_B_0X0                              (0x0u<<9)
#define OTG_FS_OTG_HCINTMSK11_FRMORM_B_0X1                              (0x1u<<9)
#define OTG_FS_OTG_HCINTMSK11_BBERRM_B_0X0                              (0x0u<<8)
#define OTG_FS_OTG_HCINTMSK11_BBERRM_B_0X1                              (0x1u<<8)
#define OTG_FS_OTG_HCINTMSK11_TXERRM_B_0X0                              (0x0u<<7)
#define OTG_FS_OTG_HCINTMSK11_TXERRM_B_0X1                              (0x1u<<7)
#define OTG_FS_OTG_HCINTMSK11_ACKM_B_0X0                                (0x0u<<5)
#define OTG_FS_OTG_HCINTMSK11_ACKM_B_0X1                                (0x1u<<5)
#define OTG_FS_OTG_HCINTMSK11_NAKM_B_0X0                                (0x0u<<4)
#define OTG_FS_OTG_HCINTMSK11_NAKM_B_0X1                                (0x1u<<4)
#define OTG_FS_OTG_HCINTMSK11_STALLM_B_0X0                              (0x0u<<3)
#define OTG_FS_OTG_HCINTMSK11_STALLM_B_0X1                              (0x1u<<3)
#define OTG_FS_OTG_HCINTMSK11_CHHM_B_0X0                                (0x0u<<1)
#define OTG_FS_OTG_HCINTMSK11_CHHM_B_0X1                                (0x1u<<1)
#define OTG_FS_OTG_HCINTMSK11_XFRCM_B_0X0                               (0x0u<<0)
#define OTG_FS_OTG_HCINTMSK11_XFRCM_B_0X1                               (0x1u<<0)

// OTG_HCTSIZ11 Configuration

#define OTG_FS_OTG_HCTSIZ11_DOPNG                                       (0x1u<<31)
#define OTG_FS_OTG_HCTSIZ11_DPID                                        (0x3u<<29)
#define OTG_FS_OTG_HCTSIZ11_DPID_0                                      (0x1u<<29)
#define OTG_FS_OTG_HCTSIZ11_PKTCNT                                      (0x3FFu<<19)
#define OTG_FS_OTG_HCTSIZ11_PKTCNT_0                                    (0x1u<<19)
#define OTG_FS_OTG_HCTSIZ11_XFRSIZ                                      (0x7FFFFu<<0)
#define OTG_FS_OTG_HCTSIZ11_XFRSIZ_0                                    (0x1u<<0)

