Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg_fs.h
#define OTG_FS_OTG_HCTSIZ11_DPID_B_0X0                                  (0x0u<<29)
#define OTG_FS_OTG_HCTSIZ11_DPID_B_0X2                                  (0x2u<<29)
#define OTG_FS_OTG_HCTSIZ11_DPID_B_0X3                                  (0x3u<<29)

// OTG_DCFG Configuration

#define OTG_FS_OTG_DCFG_ERRATIM                                         (0x1u<<15)
#define OTG_FS_OTG_DCFG_PFIVL                                           (0x3u<<11)
#define OTG_FS_OTG_DCFG_PFIVL_0                                         (0x1u<<11)
#define OTG_FS_OTG_DCFG_DAD                                             (0x7Fu<<4)
#define OTG_FS_OTG_DCFG_DAD_0                                           (0x1u<<4)
#define OTG_FS_OTG_DCFG_NZLSOHSK                                        (0x1u<<2)
#define OTG_FS_OTG_DCFG_DSPD                                            (0x3u<<0)
#define OTG_FS_OTG_DCFG_DSPD_0                                          (0x1u<<0)

#define OTG_FS_OTG_DCFG_ERRATIM_B_0X1                                   (0x1u<<15)
#define OTG_FS_OTG_DCFG_ERRATIM_B_0X0                                   (0x0u<<15)
#define OTG_FS_OTG_DCFG_PFIVL_B_0X0                                     (0x0u<<11)
#define OTG_FS_OTG_DCFG_PFIVL_B_0X1                                     (0x1u<<11)
#define OTG_FS_OTG_DCFG_PFIVL_B_0X2                                     (0x2u<<11)
#define OTG_FS_OTG_DCFG_PFIVL_B_0X3                                     (0x3u<<11)
#define OTG_FS_OTG_DCFG_NZLSOHSK_B_0X1                                  (0x1u<<2)
#define OTG_FS_OTG_DCFG_NZLSOHSK_B_0X0                                  (0x0u<<2)
#define OTG_FS_OTG_DCFG_DSPD_B_0X3                                      (0x3u<<0)

// OTG_DCTL Configuration

#define OTG_FS_OTG_DCTL_DSBESLRJCT                                      (0x1u<<18)
#define OTG_FS_OTG_DCTL_POPRGDNE                                        (0x1u<<11)
#define OTG_FS_OTG_DCTL_CGONAK                                          (0x1u<<10)
#define OTG_FS_OTG_DCTL_SGONAK                                          (0x1u<<9)
#define OTG_FS_OTG_DCTL_CGINAK                                          (0x1u<<8)
#define OTG_FS_OTG_DCTL_SGINAK                                          (0x1u<<7)
#define OTG_FS_OTG_DCTL_TCTL                                            (0x7u<<4)
#define OTG_FS_OTG_DCTL_TCTL_0                                          (0x1u<<4)
#define OTG_FS_OTG_DCTL_GONSTS                                          (0x1u<<3)
#define OTG_FS_OTG_DCTL_GINSTS                                          (0x1u<<2)
#define OTG_FS_OTG_DCTL_SDIS                                            (0x1u<<1)
#define OTG_FS_OTG_DCTL_RWUSIG                                          (0x1u<<0)

#define OTG_FS_OTG_DCTL_TCTL_B_0X0                                      (0x0u<<4)
#define OTG_FS_OTG_DCTL_TCTL_B_0X1                                      (0x1u<<4)
#define OTG_FS_OTG_DCTL_TCTL_B_0X2                                      (0x2u<<4)
#define OTG_FS_OTG_DCTL_TCTL_B_0X3                                      (0x3u<<4)
#define OTG_FS_OTG_DCTL_TCTL_B_0X4                                      (0x4u<<4)
#define OTG_FS_OTG_DCTL_TCTL_B_0X5                                      (0x5u<<4)
#define OTG_FS_OTG_DCTL_GONSTS_B_0X0                                    (0x0u<<3)
#define OTG_FS_OTG_DCTL_GONSTS_B_0X1                                    (0x1u<<3)
#define OTG_FS_OTG_DCTL_GINSTS_B_0X0                                    (0x0u<<2)
#define OTG_FS_OTG_DCTL_GINSTS_B_0X1                                    (0x1u<<2)
#define OTG_FS_OTG_DCTL_SDIS_B_0X0                                      (0x0u<<1)
#define OTG_FS_OTG_DCTL_SDIS_B_0X1                                      (0x1u<<1)

// OTG_DSTS Configuration

#define OTG_FS_OTG_DSTS_DEVLNSTS                                        (0x3u<<22)
#define OTG_FS_OTG_DSTS_DEVLNSTS_0                                      (0x1u<<22)
#define OTG_FS_OTG_DSTS_FNSOF                                           (0x3FFFu<<8)
#define OTG_FS_OTG_DSTS_FNSOF_0                                         (0x1u<<8)
#define OTG_FS_OTG_DSTS_EERR                                            (0x1u<<3)
#define OTG_FS_OTG_DSTS_ENUMSPD                                         (0x3u<<1)
#define OTG_FS_OTG_DSTS_ENUMSPD_0                                       (0x1u<<1)
#define OTG_FS_OTG_DSTS_SUSPSTS                                         (0x1u<<0)

#define OTG_FS_OTG_DSTS_ENUMSPD_B_0X3                                   (0x3u<<1)

// OTG_DIEPMSK Configuration

#define OTG_FS_OTG_DIEPMSK_NAKM                                         (0x1u<<13)
#define OTG_FS_OTG_DIEPMSK_INEPNEM                                      (0x1u<<6)
#define OTG_FS_OTG_DIEPMSK_INEPNMM                                      (0x1u<<5)
#define OTG_FS_OTG_DIEPMSK_ITTXFEMSK                                    (0x1u<<4)
#define OTG_FS_OTG_DIEPMSK_TOM                                          (0x1u<<3)
#define OTG_FS_OTG_DIEPMSK_EPDM                                         (0x1u<<1)
#define OTG_FS_OTG_DIEPMSK_XFRCM                                        (0x1u<<0)

#define OTG_FS_OTG_DIEPMSK_NAKM_B_0X0                                   (0x0u<<13)
#define OTG_FS_OTG_DIEPMSK_NAKM_B_0X1                                   (0x1u<<13)
#define OTG_FS_OTG_DIEPMSK_INEPNEM_B_0X0                                (0x0u<<6)
#define OTG_FS_OTG_DIEPMSK_INEPNEM_B_0X1                                (0x1u<<6)
#define OTG_FS_OTG_DIEPMSK_INEPNMM_B_0X0                                (0x0u<<5)
#define OTG_FS_OTG_DIEPMSK_INEPNMM_B_0X1                                (0x1u<<5)
#define OTG_FS_OTG_DIEPMSK_ITTXFEMSK_B_0X0                              (0x0u<<4)
#define OTG_FS_OTG_DIEPMSK_ITTXFEMSK_B_0X1                              (0x1u<<4)
#define OTG_FS_OTG_DIEPMSK_TOM_B_0X0                                    (0x0u<<3)
#define OTG_FS_OTG_DIEPMSK_TOM_B_0X1                                    (0x1u<<3)
#define OTG_FS_OTG_DIEPMSK_EPDM_B_0X0                                   (0x0u<<1)
#define OTG_FS_OTG_DIEPMSK_EPDM_B_0X1                                   (0x1u<<1)
#define OTG_FS_OTG_DIEPMSK_XFRCM_B_0X0                                  (0x0u<<0)
#define OTG_FS_OTG_DIEPMSK_XFRCM_B_0X1                                  (0x1u<<0)

