Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg_fs.h
// OTG_DOEPMSK Configuration

#define OTG_FS_OTG_DOEPMSK_NAKMSK                                       (0x1u<<13)
#define OTG_FS_OTG_DOEPMSK_BERRM                                        (0x1u<<12)
#define OTG_FS_OTG_DOEPMSK_OUTPKTERRM                                   (0x1u<<8)
#define OTG_FS_OTG_DOEPMSK_STSPHSRXM                                    (0x1u<<5)
#define OTG_FS_OTG_DOEPMSK_OTEPDM                                       (0x1u<<4)
#define OTG_FS_OTG_DOEPMSK_STUPM                                        (0x1u<<3)
#define OTG_FS_OTG_DOEPMSK_EPDM                                         (0x1u<<1)
#define OTG_FS_OTG_DOEPMSK_XFRCM                                        (0x1u<<0)

#define OTG_FS_OTG_DOEPMSK_NAKMSK_B_0X0                                 (0x0u<<13)
#define OTG_FS_OTG_DOEPMSK_NAKMSK_B_0X1                                 (0x1u<<13)
#define OTG_FS_OTG_DOEPMSK_BERRM_B_0X0                                  (0x0u<<12)
#define OTG_FS_OTG_DOEPMSK_BERRM_B_0X1                                  (0x1u<<12)
#define OTG_FS_OTG_DOEPMSK_OUTPKTERRM_B_0X0                             (0x0u<<8)
#define OTG_FS_OTG_DOEPMSK_OUTPKTERRM_B_0X1                             (0x1u<<8)
#define OTG_FS_OTG_DOEPMSK_STSPHSRXM_B_0X0                              (0x0u<<5)
#define OTG_FS_OTG_DOEPMSK_STSPHSRXM_B_0X1                              (0x1u<<5)
#define OTG_FS_OTG_DOEPMSK_OTEPDM_B_0X0                                 (0x0u<<4)
#define OTG_FS_OTG_DOEPMSK_OTEPDM_B_0X1                                 (0x1u<<4)
#define OTG_FS_OTG_DOEPMSK_STUPM_B_0X0                                  (0x0u<<3)
#define OTG_FS_OTG_DOEPMSK_STUPM_B_0X1                                  (0x1u<<3)
#define OTG_FS_OTG_DOEPMSK_EPDM_B_0X0                                   (0x0u<<1)
#define OTG_FS_OTG_DOEPMSK_EPDM_B_0X1                                   (0x1u<<1)
#define OTG_FS_OTG_DOEPMSK_XFRCM_B_0X0                                  (0x0u<<0)
#define OTG_FS_OTG_DOEPMSK_XFRCM_B_0X1                                  (0x1u<<0)

// OTG_DAINT Configuration

#define OTG_FS_OTG_DAINT_OEPINT                                         (0xFFFFu<<16)
#define OTG_FS_OTG_DAINT_OEPINT_0                                       (0x1u<<16)
#define OTG_FS_OTG_DAINT_IEPINT                                         (0xFFFFu<<0)
#define OTG_FS_OTG_DAINT_IEPINT_0                                       (0x1u<<0)

// OTG_DAINTMSK Configuration

#define OTG_FS_OTG_DAINTMSK_OEPM                                        (0xFFFFu<<16)
#define OTG_FS_OTG_DAINTMSK_OEPM_0                                      (0x1u<<16)
#define OTG_FS_OTG_DAINTMSK_IEPM                                        (0xFFFFu<<0)
#define OTG_FS_OTG_DAINTMSK_IEPM_0                                      (0x1u<<0)

#define OTG_FS_OTG_DAINTMSK_OEPM_B_0X0                                  (0x0u<<16)
#define OTG_FS_OTG_DAINTMSK_OEPM_B_0X1                                  (0x1u<<16)
#define OTG_FS_OTG_DAINTMSK_IEPM_B_0X0                                  (0x0u<<0)
#define OTG_FS_OTG_DAINTMSK_IEPM_B_0X1                                  (0x1u<<0)

// OTG_DIEPEMPMSK Configuration

#define OTG_FS_OTG_DIEPEMPMSK_INEPTXFEM                                 (0xFFFFu<<0)
#define OTG_FS_OTG_DIEPEMPMSK_INEPTXFEM_0                               (0x1u<<0)

#define OTG_FS_OTG_DIEPEMPMSK_INEPTXFEM_B_0X0                           (0x0u<<0)
#define OTG_FS_OTG_DIEPEMPMSK_INEPTXFEM_B_0X1                           (0x1u<<0)

// OTG_DEACHINT Configuration

#define OTG_FS_OTG_DEACHINT_OEP1INT                                     (0x1u<<17)
#define OTG_FS_OTG_DEACHINT_IEP1INT                                     (0x1u<<1)

// OTG_DEACHINTMSK Configuration

#define OTG_FS_OTG_DEACHINTMSK_OEP1INTM                                 (0x1u<<17)
#define OTG_FS_OTG_DEACHINTMSK_IEP1INTM                                 (0x1u<<1)

// OTG_HS_DIEPEACHMSK1 Configuration

#define OTG_FS_OTG_HS_DIEPEACHMSK1_NAKM                                 (0x1u<<13)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_TXFURM                               (0x1u<<8)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_INEPNEM                              (0x1u<<6)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_ITTXFEMSK                            (0x1u<<4)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_TOM                                  (0x1u<<3)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_AHBERRM                              (0x1u<<2)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_EPDM                                 (0x1u<<1)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_XFRCM                                (0x1u<<0)

#define OTG_FS_OTG_HS_DIEPEACHMSK1_NAKM_B_0X0                           (0x0u<<13)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_NAKM_B_0X1                           (0x1u<<13)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_TXFURM_B_0X0                         (0x0u<<8)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_TXFURM_B_0X1                         (0x1u<<8)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_INEPNEM_B_0X0                        (0x0u<<6)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_INEPNEM_B_0X1                        (0x1u<<6)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_ITTXFEMSK_B_0X0                      (0x0u<<4)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_ITTXFEMSK_B_0X1                      (0x1u<<4)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_TOM_B_0X0                            (0x0u<<3)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_TOM_B_0X1                            (0x1u<<3)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_AHBERRM_B_0X0                        (0x0u<<2)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_AHBERRM_B_0X1                        (0x1u<<2)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_EPDM_B_0X0                           (0x0u<<1)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_EPDM_B_0X1                           (0x1u<<1)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_XFRCM_B_0X0                          (0x0u<<0)
#define OTG_FS_OTG_HS_DIEPEACHMSK1_XFRCM_B_0X1                          (0x1u<<0)

// OTG_HS_DOEPEACHMSK1 Configuration

#define OTG_FS_OTG_HS_DOEPEACHMSK1_NYETMSK                              (0x1u<<14)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_NAKMSK                               (0x1u<<13)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_BERRM                                (0x1u<<12)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_OUTPKTERRM                           (0x1u<<8)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_B2BSTUPM                             (0x1u<<6)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_OTEPDM                               (0x1u<<4)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_STUPM                                (0x1u<<3)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_AHBERRM                              (0x1u<<2)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_EPDM                                 (0x1u<<1)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_XFRCM                                (0x1u<<0)

#define OTG_FS_OTG_HS_DOEPEACHMSK1_NYETMSK_B_0X0                        (0x0u<<14)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_NYETMSK_B_0X1                        (0x1u<<14)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_NAKMSK_B_0X0                         (0x0u<<13)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_NAKMSK_B_0X1                         (0x1u<<13)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_BERRM_B_0X0                          (0x0u<<12)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_BERRM_B_0X1                          (0x1u<<12)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_OUTPKTERRM_B_0X0                     (0x0u<<8)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_OUTPKTERRM_B_0X1                     (0x1u<<8)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_B2BSTUPM_B_0X0                       (0x0u<<6)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_B2BSTUPM_B_0X1                       (0x1u<<6)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_OTEPDM_B_0X0                         (0x0u<<4)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_OTEPDM_B_0X1                         (0x1u<<4)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_STUPM_B_0X0                          (0x0u<<3)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_STUPM_B_0X1                          (0x1u<<3)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_AHBERRM_B_0X0                        (0x0u<<2)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_AHBERRM_B_0X1                        (0x1u<<2)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_EPDM_B_0X0                           (0x0u<<1)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_EPDM_B_0X1                           (0x1u<<1)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_XFRCM_B_0X0                          (0x0u<<0)
#define OTG_FS_OTG_HS_DOEPEACHMSK1_XFRCM_B_0X1                          (0x1u<<0)

// OTG_DIEPCTL0 Configuration

#define OTG_FS_OTG_DIEPCTL0_EPENA                                       (0x1u<<31)
#define OTG_FS_OTG_DIEPCTL0_EPDIS                                       (0x1u<<30)
#define OTG_FS_OTG_DIEPCTL0_SNAK                                        (0x1u<<27)
#define OTG_FS_OTG_DIEPCTL0_CNAK                                        (0x1u<<26)
#define OTG_FS_OTG_DIEPCTL0_TXFNUM                                      (0xFu<<22)
#define OTG_FS_OTG_DIEPCTL0_TXFNUM_0                                    (0x1u<<22)
#define OTG_FS_OTG_DIEPCTL0_STALL                                       (0x1u<<21)
#define OTG_FS_OTG_DIEPCTL0_EPTYP                                       (0x3u<<18)
#define OTG_FS_OTG_DIEPCTL0_EPTYP_0                                     (0x1u<<18)
#define OTG_FS_OTG_DIEPCTL0_NAKSTS                                      (0x1u<<17)
#define OTG_FS_OTG_DIEPCTL0_USBAEP                                      (0x1u<<15)
#define OTG_FS_OTG_DIEPCTL0_MPSIZ                                       (0x3u<<0)
#define OTG_FS_OTG_DIEPCTL0_MPSIZ_0                                     (0x1u<<0)

#define OTG_FS_OTG_DIEPCTL0_NAKSTS_B_0X0                                (0x0u<<17)
#define OTG_FS_OTG_DIEPCTL0_NAKSTS_B_0X1                                (0x1u<<17)
#define OTG_FS_OTG_DIEPCTL0_MPSIZ_B_0X0                                 (0x0u<<0)
#define OTG_FS_OTG_DIEPCTL0_MPSIZ_B_0X1                                 (0x1u<<0)
#define OTG_FS_OTG_DIEPCTL0_MPSIZ_B_0X2                                 (0x2u<<0)
#define OTG_FS_OTG_DIEPCTL0_MPSIZ_B_0X3                                 (0x3u<<0)

