Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg_fs.h
#define OTG_FS_OTG_DTXFSTS2_INEPTFSAV_B_0X0                             (0x0u<<0)
#define OTG_FS_OTG_DTXFSTS2_INEPTFSAV_B_0X1                             (0x1u<<0)

// OTG_DIEPCTL3 Configuration

#define OTG_FS_OTG_DIEPCTL3_EPENA                                       (0x1u<<31)
#define OTG_FS_OTG_DIEPCTL3_EPDIS                                       (0x1u<<30)
#define OTG_FS_OTG_DIEPCTL3_SD1PID                                      (0x1u<<29)
#define OTG_FS_OTG_DIEPCTL3_SD0PID                                      (0x1u<<28)
#define OTG_FS_OTG_DIEPCTL3_SNAK                                        (0x1u<<27)
#define OTG_FS_OTG_DIEPCTL3_CNAK                                        (0x1u<<26)
#define OTG_FS_OTG_DIEPCTL3_TXFNUM                                      (0xFu<<22)
#define OTG_FS_OTG_DIEPCTL3_TXFNUM_0                                    (0x1u<<22)
#define OTG_FS_OTG_DIEPCTL3_STALL                                       (0x1u<<21)
#define OTG_FS_OTG_DIEPCTL3_EPTYP                                       (0x3u<<18)
#define OTG_FS_OTG_DIEPCTL3_EPTYP_0                                     (0x1u<<18)
#define OTG_FS_OTG_DIEPCTL3_NAKSTS                                      (0x1u<<17)
#define OTG_FS_OTG_DIEPCTL3_DPID                                        (0x1u<<16)
#define OTG_FS_OTG_DIEPCTL3_USBAEP                                      (0x1u<<15)
#define OTG_FS_OTG_DIEPCTL3_MPSIZ                                       (0x7FFu<<0)
#define OTG_FS_OTG_DIEPCTL3_MPSIZ_0                                     (0x1u<<0)

#define OTG_FS_OTG_DIEPCTL3_EPTYP_B_0X0                                 (0x0u<<18)
#define OTG_FS_OTG_DIEPCTL3_EPTYP_B_0X1                                 (0x1u<<18)
#define OTG_FS_OTG_DIEPCTL3_EPTYP_B_0X2                                 (0x2u<<18)
#define OTG_FS_OTG_DIEPCTL3_EPTYP_B_0X3                                 (0x3u<<18)
#define OTG_FS_OTG_DIEPCTL3_NAKSTS_B_0X0                                (0x0u<<17)
#define OTG_FS_OTG_DIEPCTL3_NAKSTS_B_0X1                                (0x1u<<17)
#define OTG_FS_OTG_DIEPCTL3_DPID_B_0X0                                  (0x0u<<16)
#define OTG_FS_OTG_DIEPCTL3_DPID_B_0X1                                  (0x1u<<16)

// OTG_DIEPCTL3_ALTERNATE1 Configuration

#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_EPENA                            (0x1u<<31)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_EPDIS                            (0x1u<<30)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_SODDFRM                          (0x1u<<29)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_SEVNFRM                          (0x1u<<28)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_SNAK                             (0x1u<<27)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_CNAK                             (0x1u<<26)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_TXFNUM                           (0xFu<<22)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_TXFNUM_0                         (0x1u<<22)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_STALL                            (0x1u<<21)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_EPTYP                            (0x3u<<18)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_EPTYP_0                          (0x1u<<18)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_NAKSTS                           (0x1u<<17)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_EONUM                            (0x1u<<16)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_USBAEP                           (0x1u<<15)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_MPSIZ                            (0x7FFu<<0)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_MPSIZ_0                          (0x1u<<0)

#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_EPTYP_B_0X0                      (0x0u<<18)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_EPTYP_B_0X1                      (0x1u<<18)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_EPTYP_B_0X2                      (0x2u<<18)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_EPTYP_B_0X3                      (0x3u<<18)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_NAKSTS_B_0X0                     (0x0u<<17)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_NAKSTS_B_0X1                     (0x1u<<17)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_EONUM_B_0X0                      (0x0u<<16)
#define OTG_FS_OTG_DIEPCTL3_ALTERNATE1_EONUM_B_0X1                      (0x1u<<16)

// OTG_DIEPINT3 Configuration

#define OTG_FS_OTG_DIEPINT3_NAK                                         (0x1u<<13)
#define OTG_FS_OTG_DIEPINT3_PKTDRPSTS                                   (0x1u<<11)
#define OTG_FS_OTG_DIEPINT3_TXFE                                        (0x1u<<7)
#define OTG_FS_OTG_DIEPINT3_INEPNE                                      (0x1u<<6)
#define OTG_FS_OTG_DIEPINT3_INEPNM                                      (0x1u<<5)
#define OTG_FS_OTG_DIEPINT3_ITTXFE                                      (0x1u<<4)
#define OTG_FS_OTG_DIEPINT3_TOC                                         (0x1u<<3)
#define OTG_FS_OTG_DIEPINT3_EPDISD                                      (0x1u<<1)
#define OTG_FS_OTG_DIEPINT3_XFRC                                        (0x1u<<0)

// OTG_DIEPTSIZ3 Configuration

#define OTG_FS_OTG_DIEPTSIZ3_MCNT                                       (0x3u<<29)
#define OTG_FS_OTG_DIEPTSIZ3_MCNT_0                                     (0x1u<<29)
#define OTG_FS_OTG_DIEPTSIZ3_PKTCNT                                     (0x3FFu<<19)
#define OTG_FS_OTG_DIEPTSIZ3_PKTCNT_0                                   (0x1u<<19)
#define OTG_FS_OTG_DIEPTSIZ3_XFRSIZ                                     (0x7FFFFu<<0)
#define OTG_FS_OTG_DIEPTSIZ3_XFRSIZ_0                                   (0x1u<<0)

#define OTG_FS_OTG_DIEPTSIZ3_MCNT_B_0X1                                 (0x1u<<29)
#define OTG_FS_OTG_DIEPTSIZ3_MCNT_B_0X2                                 (0x2u<<29)
#define OTG_FS_OTG_DIEPTSIZ3_MCNT_B_0X3                                 (0x3u<<29)

// OTG_DTXFSTS3 Configuration

#define OTG_FS_OTG_DTXFSTS3_INEPTFSAV                                   (0xFFFFu<<0)
#define OTG_FS_OTG_DTXFSTS3_INEPTFSAV_0                                 (0x1u<<0)

#define OTG_FS_OTG_DTXFSTS3_INEPTFSAV_B_0X0                             (0x0u<<0)
#define OTG_FS_OTG_DTXFSTS3_INEPTFSAV_B_0X1                             (0x1u<<0)

// OTG_DIEPCTL4 Configuration

#define OTG_FS_OTG_DIEPCTL4_EPENA                                       (0x1u<<31)
#define OTG_FS_OTG_DIEPCTL4_EPDIS                                       (0x1u<<30)
#define OTG_FS_OTG_DIEPCTL4_SD1PID                                      (0x1u<<29)
#define OTG_FS_OTG_DIEPCTL4_SD0PID                                      (0x1u<<28)
#define OTG_FS_OTG_DIEPCTL4_SNAK                                        (0x1u<<27)
#define OTG_FS_OTG_DIEPCTL4_CNAK                                        (0x1u<<26)
#define OTG_FS_OTG_DIEPCTL4_TXFNUM                                      (0xFu<<22)
#define OTG_FS_OTG_DIEPCTL4_TXFNUM_0                                    (0x1u<<22)
#define OTG_FS_OTG_DIEPCTL4_STALL                                       (0x1u<<21)
#define OTG_FS_OTG_DIEPCTL4_EPTYP                                       (0x3u<<18)
#define OTG_FS_OTG_DIEPCTL4_EPTYP_0                                     (0x1u<<18)
#define OTG_FS_OTG_DIEPCTL4_NAKSTS                                      (0x1u<<17)
#define OTG_FS_OTG_DIEPCTL4_DPID                                        (0x1u<<16)
#define OTG_FS_OTG_DIEPCTL4_USBAEP                                      (0x1u<<15)
#define OTG_FS_OTG_DIEPCTL4_MPSIZ                                       (0x7FFu<<0)
#define OTG_FS_OTG_DIEPCTL4_MPSIZ_0                                     (0x1u<<0)

#define OTG_FS_OTG_DIEPCTL4_EPTYP_B_0X0                                 (0x0u<<18)
#define OTG_FS_OTG_DIEPCTL4_EPTYP_B_0X1                                 (0x1u<<18)
#define OTG_FS_OTG_DIEPCTL4_EPTYP_B_0X2                                 (0x2u<<18)
#define OTG_FS_OTG_DIEPCTL4_EPTYP_B_0X3                                 (0x3u<<18)
#define OTG_FS_OTG_DIEPCTL4_NAKSTS_B_0X0                                (0x0u<<17)
#define OTG_FS_OTG_DIEPCTL4_NAKSTS_B_0X1                                (0x1u<<17)
#define OTG_FS_OTG_DIEPCTL4_DPID_B_0X0                                  (0x0u<<16)
#define OTG_FS_OTG_DIEPCTL4_DPID_B_0X1                                  (0x1u<<16)

// OTG_DIEPCTL4_ALTERNATE1 Configuration

#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_EPENA                            (0x1u<<31)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_EPDIS                            (0x1u<<30)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_SODDFRM                          (0x1u<<29)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_SEVNFRM                          (0x1u<<28)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_SNAK                             (0x1u<<27)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_CNAK                             (0x1u<<26)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_TXFNUM                           (0xFu<<22)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_TXFNUM_0                         (0x1u<<22)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_STALL                            (0x1u<<21)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_EPTYP                            (0x3u<<18)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_EPTYP_0                          (0x1u<<18)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_NAKSTS                           (0x1u<<17)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_EONUM                            (0x1u<<16)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_USBAEP                           (0x1u<<15)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_MPSIZ                            (0x7FFu<<0)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_MPSIZ_0                          (0x1u<<0)

#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_EPTYP_B_0X0                      (0x0u<<18)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_EPTYP_B_0X1                      (0x1u<<18)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_EPTYP_B_0X2                      (0x2u<<18)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_EPTYP_B_0X3                      (0x3u<<18)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_NAKSTS_B_0X0                     (0x0u<<17)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_NAKSTS_B_0X1                     (0x1u<<17)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_EONUM_B_0X0                      (0x0u<<16)
#define OTG_FS_OTG_DIEPCTL4_ALTERNATE1_EONUM_B_0X1                      (0x1u<<16)

// OTG_DIEPINT4 Configuration

#define OTG_FS_OTG_DIEPINT4_NAK                                         (0x1u<<13)
#define OTG_FS_OTG_DIEPINT4_PKTDRPSTS                                   (0x1u<<11)
#define OTG_FS_OTG_DIEPINT4_TXFE                                        (0x1u<<7)
#define OTG_FS_OTG_DIEPINT4_INEPNE                                      (0x1u<<6)
#define OTG_FS_OTG_DIEPINT4_INEPNM                                      (0x1u<<5)
#define OTG_FS_OTG_DIEPINT4_ITTXFE                                      (0x1u<<4)
#define OTG_FS_OTG_DIEPINT4_TOC                                         (0x1u<<3)
#define OTG_FS_OTG_DIEPINT4_EPDISD                                      (0x1u<<1)
#define OTG_FS_OTG_DIEPINT4_XFRC                                        (0x1u<<0)

// OTG_DIEPTSIZ4 Configuration

#define OTG_FS_OTG_DIEPTSIZ4_MCNT                                       (0x3u<<29)
#define OTG_FS_OTG_DIEPTSIZ4_MCNT_0                                     (0x1u<<29)
#define OTG_FS_OTG_DIEPTSIZ4_PKTCNT                                     (0x3FFu<<19)
#define OTG_FS_OTG_DIEPTSIZ4_PKTCNT_0                                   (0x1u<<19)
#define OTG_FS_OTG_DIEPTSIZ4_XFRSIZ                                     (0x7FFFFu<<0)
#define OTG_FS_OTG_DIEPTSIZ4_XFRSIZ_0                                   (0x1u<<0)

#define OTG_FS_OTG_DIEPTSIZ4_MCNT_B_0X1                                 (0x1u<<29)
#define OTG_FS_OTG_DIEPTSIZ4_MCNT_B_0X2                                 (0x2u<<29)
#define OTG_FS_OTG_DIEPTSIZ4_MCNT_B_0X3                                 (0x3u<<29)

// OTG_DTXFSTS4 Configuration

#define OTG_FS_OTG_DTXFSTS4_INEPTFSAV                                   (0xFFFFu<<0)
#define OTG_FS_OTG_DTXFSTS4_INEPTFSAV_0                                 (0x1u<<0)

