Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg_fs.h
// OTG_DOEPTSIZ2 Configuration

#define OTG_FS_OTG_DOEPTSIZ2_RXDPID                                     (0x3u<<29)
#define OTG_FS_OTG_DOEPTSIZ2_RXDPID_0                                   (0x1u<<29)
#define OTG_FS_OTG_DOEPTSIZ2_PKTCNT                                     (0x3FFu<<19)
#define OTG_FS_OTG_DOEPTSIZ2_PKTCNT_0                                   (0x1u<<19)
#define OTG_FS_OTG_DOEPTSIZ2_XFRSIZ                                     (0x7FFFFu<<0)
#define OTG_FS_OTG_DOEPTSIZ2_XFRSIZ_0                                   (0x1u<<0)

#define OTG_FS_OTG_DOEPTSIZ2_RXDPID_B_0X0_ISOCHRONOUS_OUT_ENDPOINTS     (0x0u<<29)
#define OTG_FS_OTG_DOEPTSIZ2_RXDPID_B_0X1_ISOCHRONOUS_OUT_ENDPOINTS     (0x1u<<29)
#define OTG_FS_OTG_DOEPTSIZ2_RXDPID_B_0X2_ISOCHRONOUS_OUT_ENDPOINTS     (0x2u<<29)
#define OTG_FS_OTG_DOEPTSIZ2_RXDPID_B_0X3_ISOCHRONOUS_OUT_ENDPOINTS     (0x3u<<29)

// OTG_DOEPCTL3 Configuration

#define OTG_FS_OTG_DOEPCTL3_EPENA                                       (0x1u<<31)
#define OTG_FS_OTG_DOEPCTL3_EPDIS                                       (0x1u<<30)
#define OTG_FS_OTG_DOEPCTL3_SD1PID                                      (0x1u<<29)
#define OTG_FS_OTG_DOEPCTL3_SD0PID                                      (0x1u<<28)
#define OTG_FS_OTG_DOEPCTL3_SNAK                                        (0x1u<<27)
#define OTG_FS_OTG_DOEPCTL3_CNAK                                        (0x1u<<26)
#define OTG_FS_OTG_DOEPCTL3_STALL                                       (0x1u<<21)
#define OTG_FS_OTG_DOEPCTL3_SNPM                                        (0x1u<<20)
#define OTG_FS_OTG_DOEPCTL3_EPTYP                                       (0x3u<<18)
#define OTG_FS_OTG_DOEPCTL3_EPTYP_0                                     (0x1u<<18)
#define OTG_FS_OTG_DOEPCTL3_NAKSTS                                      (0x1u<<17)
#define OTG_FS_OTG_DOEPCTL3_DPID                                        (0x1u<<16)
#define OTG_FS_OTG_DOEPCTL3_USBAEP                                      (0x1u<<15)
#define OTG_FS_OTG_DOEPCTL3_MPSIZ                                       (0x7FFu<<0)
#define OTG_FS_OTG_DOEPCTL3_MPSIZ_0                                     (0x1u<<0)

#define OTG_FS_OTG_DOEPCTL3_EPTYP_B_0X0                                 (0x0u<<18)
#define OTG_FS_OTG_DOEPCTL3_EPTYP_B_0X1                                 (0x1u<<18)
#define OTG_FS_OTG_DOEPCTL3_EPTYP_B_0X2                                 (0x2u<<18)
#define OTG_FS_OTG_DOEPCTL3_EPTYP_B_0X3                                 (0x3u<<18)
#define OTG_FS_OTG_DOEPCTL3_NAKSTS_B_0X0                                (0x0u<<17)
#define OTG_FS_OTG_DOEPCTL3_NAKSTS_B_0X1                                (0x1u<<17)
#define OTG_FS_OTG_DOEPCTL3_DPID_B_0X0                                  (0x0u<<16)
#define OTG_FS_OTG_DOEPCTL3_DPID_B_0X1                                  (0x1u<<16)

// OTG_DOEPCTL3_ALTERNATE1 Configuration

#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_EPENA                            (0x1u<<31)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_EPDIS                            (0x1u<<30)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_SODDFRM                          (0x1u<<29)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_SEVNFRM                          (0x1u<<28)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_SNAK                             (0x1u<<27)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_CNAK                             (0x1u<<26)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_STALL                            (0x1u<<21)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_SNPM                             (0x1u<<20)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_EPTYP                            (0x3u<<18)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_EPTYP_0                          (0x1u<<18)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_NAKSTS                           (0x1u<<17)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_EONUM                            (0x1u<<16)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_USBAEP                           (0x1u<<15)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_MPSIZ                            (0x7FFu<<0)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_MPSIZ_0                          (0x1u<<0)

#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_EPTYP_B_0X0                      (0x0u<<18)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_EPTYP_B_0X1                      (0x1u<<18)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_EPTYP_B_0X2                      (0x2u<<18)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_EPTYP_B_0X3                      (0x3u<<18)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_NAKSTS_B_0X0                     (0x0u<<17)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_NAKSTS_B_0X1                     (0x1u<<17)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_EONUM_B_0X0                      (0x0u<<16)
#define OTG_FS_OTG_DOEPCTL3_ALTERNATE1_EONUM_B_0X1                      (0x1u<<16)

// OTG_DOEPINT3 Configuration

#define OTG_FS_OTG_DOEPINT3_NAK                                         (0x1u<<13)
#define OTG_FS_OTG_DOEPINT3_BERR                                        (0x1u<<12)
#define OTG_FS_OTG_DOEPINT3_STSPHSRX                                    (0x1u<<5)
#define OTG_FS_OTG_DOEPINT3_OTEPDIS                                     (0x1u<<4)
#define OTG_FS_OTG_DOEPINT3_STUP                                        (0x1u<<3)
#define OTG_FS_OTG_DOEPINT3_EPDISD                                      (0x1u<<1)
#define OTG_FS_OTG_DOEPINT3_XFRC                                        (0x1u<<0)

// OTG_DOEPTSIZ3 Configuration

#define OTG_FS_OTG_DOEPTSIZ3_RXDPID                                     (0x3u<<29)
#define OTG_FS_OTG_DOEPTSIZ3_RXDPID_0                                   (0x1u<<29)
#define OTG_FS_OTG_DOEPTSIZ3_PKTCNT                                     (0x3FFu<<19)
#define OTG_FS_OTG_DOEPTSIZ3_PKTCNT_0                                   (0x1u<<19)
#define OTG_FS_OTG_DOEPTSIZ3_XFRSIZ                                     (0x7FFFFu<<0)
#define OTG_FS_OTG_DOEPTSIZ3_XFRSIZ_0                                   (0x1u<<0)

#define OTG_FS_OTG_DOEPTSIZ3_RXDPID_B_0X0_ISOCHRONOUS_OUT_ENDPOINTS     (0x0u<<29)
#define OTG_FS_OTG_DOEPTSIZ3_RXDPID_B_0X1_ISOCHRONOUS_OUT_ENDPOINTS     (0x1u<<29)
#define OTG_FS_OTG_DOEPTSIZ3_RXDPID_B_0X2_ISOCHRONOUS_OUT_ENDPOINTS     (0x2u<<29)
#define OTG_FS_OTG_DOEPTSIZ3_RXDPID_B_0X3_ISOCHRONOUS_OUT_ENDPOINTS     (0x3u<<29)

// OTG_DOEPCTL4 Configuration

#define OTG_FS_OTG_DOEPCTL4_EPENA                                       (0x1u<<31)
#define OTG_FS_OTG_DOEPCTL4_EPDIS                                       (0x1u<<30)
#define OTG_FS_OTG_DOEPCTL4_SD1PID                                      (0x1u<<29)
#define OTG_FS_OTG_DOEPCTL4_SD0PID                                      (0x1u<<28)
#define OTG_FS_OTG_DOEPCTL4_SNAK                                        (0x1u<<27)
#define OTG_FS_OTG_DOEPCTL4_CNAK                                        (0x1u<<26)
#define OTG_FS_OTG_DOEPCTL4_STALL                                       (0x1u<<21)
#define OTG_FS_OTG_DOEPCTL4_SNPM                                        (0x1u<<20)
#define OTG_FS_OTG_DOEPCTL4_EPTYP                                       (0x3u<<18)
#define OTG_FS_OTG_DOEPCTL4_EPTYP_0                                     (0x1u<<18)
#define OTG_FS_OTG_DOEPCTL4_NAKSTS                                      (0x1u<<17)
#define OTG_FS_OTG_DOEPCTL4_DPID                                        (0x1u<<16)
#define OTG_FS_OTG_DOEPCTL4_USBAEP                                      (0x1u<<15)
#define OTG_FS_OTG_DOEPCTL4_MPSIZ                                       (0x7FFu<<0)
#define OTG_FS_OTG_DOEPCTL4_MPSIZ_0                                     (0x1u<<0)

#define OTG_FS_OTG_DOEPCTL4_EPTYP_B_0X0                                 (0x0u<<18)
#define OTG_FS_OTG_DOEPCTL4_EPTYP_B_0X1                                 (0x1u<<18)
#define OTG_FS_OTG_DOEPCTL4_EPTYP_B_0X2                                 (0x2u<<18)
#define OTG_FS_OTG_DOEPCTL4_EPTYP_B_0X3                                 (0x3u<<18)
#define OTG_FS_OTG_DOEPCTL4_NAKSTS_B_0X0                                (0x0u<<17)
#define OTG_FS_OTG_DOEPCTL4_NAKSTS_B_0X1                                (0x1u<<17)
#define OTG_FS_OTG_DOEPCTL4_DPID_B_0X0                                  (0x0u<<16)
#define OTG_FS_OTG_DOEPCTL4_DPID_B_0X1                                  (0x1u<<16)

// OTG_DOEPCTL4_ALTERNATE1 Configuration

#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_EPENA                            (0x1u<<31)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_EPDIS                            (0x1u<<30)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_SODDFRM                          (0x1u<<29)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_SEVNFRM                          (0x1u<<28)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_SNAK                             (0x1u<<27)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_CNAK                             (0x1u<<26)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_STALL                            (0x1u<<21)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_SNPM                             (0x1u<<20)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_EPTYP                            (0x3u<<18)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_EPTYP_0                          (0x1u<<18)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_NAKSTS                           (0x1u<<17)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_EONUM                            (0x1u<<16)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_USBAEP                           (0x1u<<15)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_MPSIZ                            (0x7FFu<<0)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_MPSIZ_0                          (0x1u<<0)

#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_EPTYP_B_0X0                      (0x0u<<18)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_EPTYP_B_0X1                      (0x1u<<18)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_EPTYP_B_0X2                      (0x2u<<18)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_EPTYP_B_0X3                      (0x3u<<18)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_NAKSTS_B_0X0                     (0x0u<<17)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_NAKSTS_B_0X1                     (0x1u<<17)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_EONUM_B_0X0                      (0x0u<<16)
#define OTG_FS_OTG_DOEPCTL4_ALTERNATE1_EONUM_B_0X1                      (0x1u<<16)

// OTG_DOEPINT4 Configuration

